SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keta_template/common/hc32f460keta.h
typedef struct
{
    uint8_t RESERVED0[12];
    union
    {
        __IO uint16_t PWR_STPMCR;
        stc_sysreg_pwr_stpmcr_field_t PWR_STPMCR_f;
    };
    uint8_t RESERVED1[2];
    union
    {
        __IO uint16_t CMU_PERICKSEL;
        stc_sysreg_cmu_pericksel_field_t CMU_PERICKSEL_f;
    };
    union
    {
        __IO uint16_t CMU_I2SCKSEL;
        stc_sysreg_cmu_i2scksel_field_t CMU_I2SCKSEL_f;
    };
    union
    {
        __IO uint32_t PWR_RAMPC0;
        stc_sysreg_pwr_rampc0_field_t PWR_RAMPC0_f;
    };
    __IO uint16_t PWR_RAMOPM;
    uint8_t RESERVED5[2];
    union
    {
        __IO uint32_t MPU_IPPR;
        stc_sysreg_mpu_ippr_field_t MPU_IPPR_f;
    };
    union
    {
        __IO uint32_t CMU_SCFGR;
        stc_sysreg_cmu_scfgr_field_t CMU_SCFGR_f;
    };
    union
    {
        __IO uint8_t CMU_UFSCKCFGR;
        stc_sysreg_cmu_ufsckcfgr_field_t CMU_UFSCKCFGR_f;
    };
    uint8_t RESERVED8[1];
    union
    {
        __IO uint8_t CMU_CKSWR;
        stc_sysreg_cmu_ckswr_field_t CMU_CKSWR_f;
    };
    uint8_t RESERVED9[3];
    union
    {
        __IO uint8_t CMU_PLLCR;
        stc_sysreg_cmu_pllcr_field_t CMU_PLLCR_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t CMU_UPLLCR;
        stc_sysreg_cmu_upllcr_field_t CMU_UPLLCR_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t CMU_XTALCR;
        stc_sysreg_cmu_xtalcr_field_t CMU_XTALCR_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t CMU_HRCCR;
        stc_sysreg_cmu_hrccr_field_t CMU_HRCCR_f;
    };
    uint8_t RESERVED13[1];
    union
    {
        __IO uint8_t CMU_MRCCR;
        stc_sysreg_cmu_mrccr_field_t CMU_MRCCR_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t CMU_OSCSTBSR;
        stc_sysreg_cmu_oscstbsr_field_t CMU_OSCSTBSR_f;
    };
    union
    {
        __IO uint8_t CMU_MCO1CFGR;
        stc_sysreg_cmu_mco1cfgr_field_t CMU_MCO1CFGR_f;
    };
    union
    {
        __IO uint8_t CMU_MCO2CFGR;
        stc_sysreg_cmu_mco2cfgr_field_t CMU_MCO2CFGR_f;
    };
    union
    {
        __IO uint8_t CMU_TPIUCKCFGR;
        stc_sysreg_cmu_tpiuckcfgr_field_t CMU_TPIUCKCFGR_f;
    };
    union
    {
        __IO uint8_t CMU_XTALSTDCR;
        stc_sysreg_cmu_xtalstdcr_field_t CMU_XTALSTDCR_f;
    };
    union
    {
        __IO uint8_t CMU_XTALSTDSR;
        stc_sysreg_cmu_xtalstdsr_field_t CMU_XTALSTDSR_f;
    };
    uint8_t RESERVED20[31];
    __IO uint8_t CMU_MRCTRM;
    __IO uint8_t CMU_HRCTRM;
    uint8_t RESERVED22[63];
    union
    {
        __IO uint8_t CMU_XTALSTBCR;
        stc_sysreg_cmu_xtalstbcr_field_t CMU_XTALSTBCR_f;
    };
    uint8_t RESERVED23[29];
    union
    {
        __IO uint16_t RMU_RSTF0;
        stc_sysreg_rmu_rstf0_field_t RMU_RSTF0_f;
    };
    uint8_t RESERVED24[30];
    union
    {
        __IO uint8_t PWR_PVDICR;
        stc_sysreg_pwr_pvdicr_field_t PWR_PVDICR_f;
    };
    union
    {
        __IO uint8_t PWR_PVDDSR;
        stc_sysreg_pwr_pvddsr_field_t PWR_PVDDSR_f;
    };
    uint8_t RESERVED26[30];
    union
    {
        __IO uint32_t CMU_PLLCFGR;
        stc_sysreg_cmu_pllcfgr_field_t CMU_PLLCFGR_f;
    };
    union
    {
        __IO uint32_t CMU_UPLLCFGR;
        stc_sysreg_cmu_upllcfgr_field_t CMU_UPLLCFGR_f;
    };
    uint8_t RESERVED28[758];
    union
    {
        __IO uint16_t PWR_FPRC;
        stc_sysreg_pwr_fprc_field_t PWR_FPRC_f;
    };
    union
    {
        __IO uint8_t PWR_PWRC0;
        stc_sysreg_pwr_pwrc0_field_t PWR_PWRC0_f;
    };
    union
    {
        __IO uint8_t PWR_PWRC1;
        stc_sysreg_pwr_pwrc1_field_t PWR_PWRC1_f;
    };
    union
    {
        __IO uint8_t PWR_PWRC2;
        stc_sysreg_pwr_pwrc2_field_t PWR_PWRC2_f;
    };
    union
    {
        __IO uint8_t PWR_PWRC3;
        stc_sysreg_pwr_pwrc3_field_t PWR_PWRC3_f;
    };
    union
    {
        __IO uint8_t PWR_PDWKE0;
        stc_sysreg_pwr_pdwke0_field_t PWR_PDWKE0_f;
    };
    union
    {
        __IO uint8_t PWR_PDWKE1;
        stc_sysreg_pwr_pdwke1_field_t PWR_PDWKE1_f;
    };
    union
    {
        __IO uint8_t PWR_PDWKE2;
        stc_sysreg_pwr_pdwke2_field_t PWR_PDWKE2_f;
    };
    union
    {
        __IO uint8_t PWR_PDWKES;
        stc_sysreg_pwr_pdwkes_field_t PWR_PDWKES_f;
    };
    union
    {
        __IO uint8_t PWR_PDWKF0;
        stc_sysreg_pwr_pdwkf0_field_t PWR_PDWKF0_f;
    };
    union
    {
        __IO uint8_t PWR_PDWKF1;
        stc_sysreg_pwr_pdwkf1_field_t PWR_PDWKF1_f;
    };
    union
    {
        __IO uint8_t PWR_PWCMR;
        stc_sysreg_pwr_pwcmr_field_t PWR_PWCMR_f;
    };
    uint8_t RESERVED40[4];
    __IO uint8_t PWR_MDSWCR;
    union
    {
        __IO uint8_t CMU_XTALCFGR;
        stc_sysreg_cmu_xtalcfgr_field_t CMU_XTALCFGR_f;
    };
    uint8_t RESERVED42[1];
    union
    {
        __IO uint8_t PWR_PVDCR0;
        stc_sysreg_pwr_pvdcr0_field_t PWR_PVDCR0_f;
    };
    union
    {
        __IO uint8_t PWR_PVDCR1;
        stc_sysreg_pwr_pvdcr1_field_t PWR_PVDCR1_f;
    };
    union
    {
        __IO uint8_t PWR_PVDFCR;
        stc_sysreg_pwr_pvdfcr_field_t PWR_PVDFCR_f;
    };
    union
    {
        __IO uint8_t PWR_PVDLCR;
        stc_sysreg_pwr_pvdlcr_field_t PWR_PVDLCR_f;
    };
    uint8_t RESERVED46[10];
    union
    {
        __IO uint8_t CMU_XTAL32CR;
        stc_sysreg_cmu_xtal32cr_field_t CMU_XTAL32CR_f;
    };
    union
    {
        __IO uint8_t CMU_XTAL32CFGR;
        stc_sysreg_cmu_xtal32cfgr_field_t CMU_XTAL32CFGR_f;
    };
    uint8_t RESERVED48[3];
    union
    {
        __IO uint8_t CMU_XTAL32NFR;
        stc_sysreg_cmu_xtal32nfr_field_t CMU_XTAL32NFR_f;
    };
    uint8_t RESERVED49[1];
    union
    {
        __IO uint8_t CMU_LRCCR;
        stc_sysreg_cmu_lrccr_field_t CMU_LRCCR_f;
    };
    uint8_t RESERVED50[1];
    __IO uint8_t CMU_LRCTRM;
    uint8_t RESERVED51[1];
    union
    {
        __IO uint8_t PWR_XTAL32CS;
        stc_sysreg_pwr_xtal32cs_field_t PWR_XTAL32CS_f;
    };
}M4_SYSREG_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CNTAR;
        stc_tmr0_cntar_field_t CNTAR_f;
    };
    union
    {
        __IO uint32_t CNTBR;
        stc_tmr0_cntbr_field_t CNTBR_f;
    };
    union
    {
        __IO uint32_t CMPAR;
        stc_tmr0_cmpar_field_t CMPAR_f;
    };
    union
    {
        __IO uint32_t CMPBR;
        stc_tmr0_cmpbr_field_t CMPBR_f;
    };
    union
    {
        __IO uint32_t BCONR;
        stc_tmr0_bconr_field_t BCONR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_tmr0_stflr_field_t STFLR_f;
    };
}M4_TMR0_TypeDef;

typedef struct
{
    uint8_t RESERVED0[2];
    __IO uint16_t OCCRUH;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCRUL;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCRVH;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCRVL;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCRWH;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCRWL;
    union
    {
        __IO uint16_t OCSRU;
        stc_tmr4_ocsr_field_t OCSRU_f;
    };
    union
    {
        __IO uint16_t OCERU;
        stc_tmr4_ocer_field_t OCERU_f;
    };
    union
    {
        __IO uint16_t OCSRV;
        stc_tmr4_ocsr_field_t OCSRV_f;
    };
    union
    {
        __IO uint16_t OCERV;
        stc_tmr4_ocer_field_t OCERV_f;
    };
    union
    {
        __IO uint16_t OCSRW;
        stc_tmr4_ocsr_field_t OCSRW_f;
    };
    union
    {
        __IO uint16_t OCERW;
        stc_tmr4_ocer_field_t OCERW_f;
    };
    union
    {
        __IO uint16_t OCMRHUH;
        stc_tmr4_ocmrh_field_t OCMRHUH_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint32_t OCMRLUL;
        stc_tmr4_ocmrl_field_t OCMRLUL_f;
    };
    union
    {
        __IO uint16_t OCMRHVH;
        stc_tmr4_ocmrh_field_t OCMRHVH_f;
    };
    uint8_t RESERVED15[2];
    union
    {
        __IO uint32_t OCMRLVL;
        stc_tmr4_ocmrl_field_t OCMRLVL_f;
    };
    union
    {
        __IO uint16_t OCMRHWH;
        stc_tmr4_ocmrh_field_t OCMRHWH_f;
    };
    uint8_t RESERVED17[2];
    union
    {
        __IO uint32_t OCMRLWL;
        stc_tmr4_ocmrl_field_t OCMRLWL_f;
    };
    uint8_t RESERVED18[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED19[2];
    __IO uint16_t CNTR;
    union
    {
        __IO uint16_t CCSR;
        stc_tmr4_ccsr_field_t CCSR_f;
    };
    union
    {
        __IO uint16_t CVPR;
        stc_tmr4_cvpr_field_t CVPR_f;
    };
    uint8_t RESERVED22[54];
    __IO uint16_t PFSRU;
    __IO uint16_t PDARU;
    __IO uint16_t PDBRU;
    uint8_t RESERVED25[2];
    __IO uint16_t PFSRV;
    __IO uint16_t PDARV;
    __IO uint16_t PDBRV;
    uint8_t RESERVED28[2];
    __IO uint16_t PFSRW;
    __IO uint16_t PDARW;
    __IO uint16_t PDBRW;
    union
    {
        __IO uint16_t POCRU;
        stc_tmr4_pocr_field_t POCRU_f;
    };
    uint8_t RESERVED32[2];
    union
    {
        __IO uint16_t POCRV;
        stc_tmr4_pocr_field_t POCRV_f;
    };
    uint8_t RESERVED33[2];
    union
    {
        __IO uint16_t POCRW;
        stc_tmr4_pocr_field_t POCRW_f;
    };
    uint8_t RESERVED34[2];
    union
    {
        __IO uint16_t RCSR;
        stc_tmr4_rcsr_field_t RCSR_f;
    };
    uint8_t RESERVED35[12];
    __IO uint16_t SCCRUH;
    uint8_t RESERVED36[2];
    __IO uint16_t SCCRUL;
    uint8_t RESERVED37[2];
    __IO uint16_t SCCRVH;
    uint8_t RESERVED38[2];
    __IO uint16_t SCCRVL;
    uint8_t RESERVED39[2];
    __IO uint16_t SCCRWH;
    uint8_t RESERVED40[2];
    __IO uint16_t SCCRWL;
    union
    {
        __IO uint16_t SCSRUH;
        stc_tmr4_scsr_field_t SCSRUH_f;
    };
    union
    {
        __IO uint16_t SCMRUH;
        stc_tmr4_scmr_field_t SCMRUH_f;
    };
    union
    {
        __IO uint16_t SCSRUL;
        stc_tmr4_scsr_field_t SCSRUL_f;
    };
    union
    {
        __IO uint16_t SCMRUL;
        stc_tmr4_scmr_field_t SCMRUL_f;
    };
    union
    {
        __IO uint16_t SCSRVH;
        stc_tmr4_scsr_field_t SCSRVH_f;
    };
    union
    {
        __IO uint16_t SCMRVH;
        stc_tmr4_scmr_field_t SCMRVH_f;
    };
    union
    {
        __IO uint16_t SCSRVL;
        stc_tmr4_scsr_field_t SCSRVL_f;
    };
    union
    {
        __IO uint16_t SCMRVL;
        stc_tmr4_scmr_field_t SCMRVL_f;
    };
    union
    {
        __IO uint16_t SCSRWH;
        stc_tmr4_scsr_field_t SCSRWH_f;
    };
    union
    {
        __IO uint16_t SCMRWH;
        stc_tmr4_scmr_field_t SCMRWH_f;
    };
    union
    {
        __IO uint16_t SCSRWL;
        stc_tmr4_scsr_field_t SCSRWL_f;
    };
    union
    {
        __IO uint16_t SCMRWL;
        stc_tmr4_scmr_field_t SCMRWL_f;
    };
    uint8_t RESERVED53[16];
    union
    {
        __IO uint16_t ECSR;
        stc_tmr4_ecsr_field_t ECSR_f;
    };
}M4_TMR4_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t ECER1;
        stc_tmr4_cr_ecer1_field_t ECER1_f;
    };
    uint8_t RESERVED1[2];
    union
    {
        __IO uint16_t ECER2;
        stc_tmr4_cr_ecer2_field_t ECER2_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint16_t ECER3;
        stc_tmr4_cr_ecer3_field_t ECER3_f;
    };
}M4_TMR4_CR_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CNTER;
        stc_tmr6_cnter_field_t CNTER_f;
    };
    union
    {
        __IO uint32_t PERAR;
        stc_tmr6_perar_field_t PERAR_f;
    };
    union
    {
        __IO uint32_t PERBR;
        stc_tmr6_perbr_field_t PERBR_f;
    };
    union
    {
        __IO uint32_t PERCR;
        stc_tmr6_percr_field_t PERCR_f;
    };
    union
    {
        __IO uint32_t GCMAR;
        stc_tmr6_gcmar_field_t GCMAR_f;
    };
    union
    {
        __IO uint32_t GCMBR;
        stc_tmr6_gcmbr_field_t GCMBR_f;
    };
    union
    {
        __IO uint32_t GCMCR;
        stc_tmr6_gcmcr_field_t GCMCR_f;
    };
    union
    {
        __IO uint32_t GCMDR;
        stc_tmr6_gcmdr_field_t GCMDR_f;
    };
    union
    {
        __IO uint32_t GCMER;
        stc_tmr6_gcmer_field_t GCMER_f;
    };
    union
    {
        __IO uint32_t GCMFR;
        stc_tmr6_gcmfr_field_t GCMFR_f;
    };
    union
    {
        __IO uint32_t SCMAR;
        stc_tmr6_scmar_field_t SCMAR_f;
    };
    union
    {
        __IO uint32_t SCMBR;
        stc_tmr6_scmbr_field_t SCMBR_f;
    };
    union
    {
        __IO uint32_t SCMCR;
        stc_tmr6_scmcr_field_t SCMCR_f;
    };
    union
    {
        __IO uint32_t SCMDR;
        stc_tmr6_scmdr_field_t SCMDR_f;
    };
    union
    {
        __IO uint32_t SCMER;
        stc_tmr6_scmer_field_t SCMER_f;
    };
    union
    {
        __IO uint32_t SCMFR;
        stc_tmr6_scmfr_field_t SCMFR_f;
    };
    union
    {
        __IO uint32_t DTUAR;
        stc_tmr6_dtuar_field_t DTUAR_f;
    };
    union
    {
        __IO uint32_t DTDAR;
        stc_tmr6_dtdar_field_t DTDAR_f;
    };
    union
    {
        __IO uint32_t DTUBR;
        stc_tmr6_dtubr_field_t DTUBR_f;
    };
    union
    {
        __IO uint32_t DTDBR;
        stc_tmr6_dtdbr_field_t DTDBR_f;
    };
    union
    {
        __IO uint32_t GCONR;
        stc_tmr6_gconr_field_t GCONR_f;
    };
    union
    {
        __IO uint32_t ICONR;
        stc_tmr6_iconr_field_t ICONR_f;
    };
    union
    {
        __IO uint32_t PCONR;
        stc_tmr6_pconr_field_t PCONR_f;
    };
    union
    {
        __IO uint32_t BCONR;
        stc_tmr6_bconr_field_t BCONR_f;
    };
    union
    {
        __IO uint32_t DCONR;
        stc_tmr6_dconr_field_t DCONR_f;
    };
    uint8_t RESERVED25[4];
    union
    {
        __IO uint32_t FCONR;
        stc_tmr6_fconr_field_t FCONR_f;
    };
    union
    {
        __IO uint32_t VPERR;
        stc_tmr6_vperr_field_t VPERR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_tmr6_stflr_field_t STFLR_f;
    };
    union
    {
        __IO uint32_t HSTAR;
        stc_tmr6_hstar_field_t HSTAR_f;
    };
    union
    {
        __IO uint32_t HSTPR;
        stc_tmr6_hstpr_field_t HSTPR_f;
    };
    union
    {
        __IO uint32_t HCLRR;
        stc_tmr6_hclrr_field_t HCLRR_f;
    };
    union
    {
        __IO uint32_t HCPAR;
        stc_tmr6_hcpar_field_t HCPAR_f;
    };
    union
    {
        __IO uint32_t HCPBR;
        stc_tmr6_hcpbr_field_t HCPBR_f;
    };
    union
    {
        __IO uint32_t HCUPR;
        stc_tmr6_hcupr_field_t HCUPR_f;
    };
    union
    {
        __IO uint32_t HCDOR;
        stc_tmr6_hcdor_field_t HCDOR_f;
    };
}M4_TMR6_TypeDef;

typedef struct
{
    uint8_t RESERVED0[1012];
    union
    {
        __IO uint32_t SSTAR;
        stc_tmr6_cr_sstar_field_t SSTAR_f;
    };
    union
    {
        __IO uint32_t SSTPR;
        stc_tmr6_cr_sstpr_field_t SSTPR_f;
    };
    union
    {
        __IO uint32_t SCLRR;
        stc_tmr6_cr_sclrr_field_t SCLRR_f;
    };
}M4_TMR6_CR_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CNTER;
        stc_tmra_cnter_field_t CNTER_f;
    };
    union
    {
        __IO uint32_t PERAR;
        stc_tmra_perar_field_t PERAR_f;
    };
    uint8_t RESERVED2[56];
    union
    {
        __IO uint32_t CMPAR1;
        stc_tmra_cmpar_field_t CMPAR1_f;
    };
    union
    {
        __IO uint32_t CMPAR2;
        stc_tmra_cmpar_field_t CMPAR2_f;
    };
    union
    {
        __IO uint32_t CMPAR3;
        stc_tmra_cmpar_field_t CMPAR3_f;
    };
    union
    {
        __IO uint32_t CMPAR4;
        stc_tmra_cmpar_field_t CMPAR4_f;
    };
    union
    {
        __IO uint32_t CMPAR5;
        stc_tmra_cmpar_field_t CMPAR5_f;
    };
    union
    {
        __IO uint32_t CMPAR6;
        stc_tmra_cmpar_field_t CMPAR6_f;
    };
    union
    {
        __IO uint32_t CMPAR7;
        stc_tmra_cmpar_field_t CMPAR7_f;
    };
    union
    {
        __IO uint32_t CMPAR8;
        stc_tmra_cmpar_field_t CMPAR8_f;
    };
    uint8_t RESERVED10[32];
    union
    {
        __IO uint32_t BCSTR;
        stc_tmra_bcstr_field_t BCSTR_f;
    };
    union
    {
        __IO uint32_t HCONR;
        stc_tmra_hconr_field_t HCONR_f;
    };
    union
    {
        __IO uint32_t HCUPR;
        stc_tmra_hcupr_field_t HCUPR_f;
    };
    union
    {
        __IO uint32_t HCDOR;
        stc_tmra_hcdor_field_t HCDOR_f;
    };
    union
    {
        __IO uint32_t ICONR;
        stc_tmra_iconr_field_t ICONR_f;
    };
    union
    {
        __IO uint32_t ECONR;
        stc_tmra_econr_field_t ECONR_f;
    };
    union
    {
        __IO uint32_t FCONR;
        stc_tmra_fconr_field_t FCONR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_tmra_stflr_field_t STFLR_f;
    };
    uint8_t RESERVED18[32];
    union
    {
        __IO uint32_t BCONR1;
        stc_tmra_bconr_field_t BCONR1_f;
    };
    uint8_t RESERVED19[4];
    union
    {
        __IO uint32_t BCONR2;
        stc_tmra_bconr_field_t BCONR2_f;
    };
    uint8_t RESERVED20[4];
    union
    {
        __IO uint32_t BCONR3;
        stc_tmra_bconr_field_t BCONR3_f;
    };
    uint8_t RESERVED21[4];
    union
    {
        __IO uint32_t BCONR4;
        stc_tmra_bconr_field_t BCONR4_f;
    };
    uint8_t RESERVED22[36];
    union
    {
        __IO uint32_t CCONR1;
        stc_tmra_cconr_field_t CCONR1_f;
    };
    union
    {
        __IO uint32_t CCONR2;
        stc_tmra_cconr_field_t CCONR2_f;
    };
    union
    {
        __IO uint32_t CCONR3;
        stc_tmra_cconr_field_t CCONR3_f;
    };
    union
    {
        __IO uint32_t CCONR4;
        stc_tmra_cconr_field_t CCONR4_f;
    };
    union
    {
        __IO uint32_t CCONR5;
        stc_tmra_cconr_field_t CCONR5_f;
    };
    union
    {
        __IO uint32_t CCONR6;
        stc_tmra_cconr_field_t CCONR6_f;
    };
    union
    {
        __IO uint32_t CCONR7;
        stc_tmra_cconr_field_t CCONR7_f;
    };
    union
    {
        __IO uint32_t CCONR8;
        stc_tmra_cconr_field_t CCONR8_f;
    };
    uint8_t RESERVED30[32];
    union
    {
        __IO uint32_t PCONR1;
        stc_tmra_pconr_field_t PCONR1_f;
    };
    union
    {
        __IO uint32_t PCONR2;
        stc_tmra_pconr_field_t PCONR2_f;
    };
    union
    {
        __IO uint32_t PCONR3;
        stc_tmra_pconr_field_t PCONR3_f;
    };
    union
    {
        __IO uint32_t PCONR4;
        stc_tmra_pconr_field_t PCONR4_f;
    };
    union
    {
        __IO uint32_t PCONR5;
        stc_tmra_pconr_field_t PCONR5_f;
    };
    union
    {
        __IO uint32_t PCONR6;
        stc_tmra_pconr_field_t PCONR6_f;
    };
    union
    {
        __IO uint32_t PCONR7;
        stc_tmra_pconr_field_t PCONR7_f;
    };
    union
    {
        __IO uint32_t PCONR8;
        stc_tmra_pconr_field_t PCONR8_f;
    };
}M4_TMRA_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_trng_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t MR;
        stc_trng_mr_field_t MR_f;
    };
    uint8_t RESERVED2[4];
    __IO uint32_t DR0;
    __IO uint32_t DR1;
}M4_TRNG_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t SR;
        stc_usart_sr_field_t SR_f;
    };
    union
    {
        __IO uint32_t DR;
        stc_usart_dr_field_t DR_f;
    };
    union
    {
        __IO uint32_t BRR;
        stc_usart_brr_field_t BRR_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_usart_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t CR2;
        stc_usart_cr2_field_t CR2_f;
    };
    union
    {
        __IO uint32_t CR3;
        stc_usart_cr3_field_t CR3_f;
    };
    union
    {
        __IO uint32_t PR;
        stc_usart_pr_field_t PR_f;
    };
}M4_USART_TypeDef;

