SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keta_template/common/hc32f460keta.h
#define bM4_DMA1_RPTB2_SRPTB2                     (*((volatile unsigned int*)(0x42A61988UL)))
#define bM4_DMA1_RPTB2_SRPTB3                     (*((volatile unsigned int*)(0x42A6198CUL)))
#define bM4_DMA1_RPTB2_SRPTB4                     (*((volatile unsigned int*)(0x42A61990UL)))
#define bM4_DMA1_RPTB2_SRPTB5                     (*((volatile unsigned int*)(0x42A61994UL)))
#define bM4_DMA1_RPTB2_SRPTB6                     (*((volatile unsigned int*)(0x42A61998UL)))
#define bM4_DMA1_RPTB2_SRPTB7                     (*((volatile unsigned int*)(0x42A6199CUL)))
#define bM4_DMA1_RPTB2_SRPTB8                     (*((volatile unsigned int*)(0x42A619A0UL)))
#define bM4_DMA1_RPTB2_SRPTB9                     (*((volatile unsigned int*)(0x42A619A4UL)))
#define bM4_DMA1_RPTB2_DRPTB0                     (*((volatile unsigned int*)(0x42A619C0UL)))
#define bM4_DMA1_RPTB2_DRPTB1                     (*((volatile unsigned int*)(0x42A619C4UL)))
#define bM4_DMA1_RPTB2_DRPTB2                     (*((volatile unsigned int*)(0x42A619C8UL)))
#define bM4_DMA1_RPTB2_DRPTB3                     (*((volatile unsigned int*)(0x42A619CCUL)))
#define bM4_DMA1_RPTB2_DRPTB4                     (*((volatile unsigned int*)(0x42A619D0UL)))
#define bM4_DMA1_RPTB2_DRPTB5                     (*((volatile unsigned int*)(0x42A619D4UL)))
#define bM4_DMA1_RPTB2_DRPTB6                     (*((volatile unsigned int*)(0x42A619D8UL)))
#define bM4_DMA1_RPTB2_DRPTB7                     (*((volatile unsigned int*)(0x42A619DCUL)))
#define bM4_DMA1_RPTB2_DRPTB8                     (*((volatile unsigned int*)(0x42A619E0UL)))
#define bM4_DMA1_RPTB2_DRPTB9                     (*((volatile unsigned int*)(0x42A619E4UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET0               (*((volatile unsigned int*)(0x42A61A00UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET1               (*((volatile unsigned int*)(0x42A61A04UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET2               (*((volatile unsigned int*)(0x42A61A08UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET3               (*((volatile unsigned int*)(0x42A61A0CUL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET4               (*((volatile unsigned int*)(0x42A61A10UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET5               (*((volatile unsigned int*)(0x42A61A14UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET6               (*((volatile unsigned int*)(0x42A61A18UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET7               (*((volatile unsigned int*)(0x42A61A1CUL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET8               (*((volatile unsigned int*)(0x42A61A20UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET9               (*((volatile unsigned int*)(0x42A61A24UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET10              (*((volatile unsigned int*)(0x42A61A28UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET11              (*((volatile unsigned int*)(0x42A61A2CUL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET12              (*((volatile unsigned int*)(0x42A61A30UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET13              (*((volatile unsigned int*)(0x42A61A34UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET14              (*((volatile unsigned int*)(0x42A61A38UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET15              (*((volatile unsigned int*)(0x42A61A3CUL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET16              (*((volatile unsigned int*)(0x42A61A40UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET17              (*((volatile unsigned int*)(0x42A61A44UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET18              (*((volatile unsigned int*)(0x42A61A48UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET19              (*((volatile unsigned int*)(0x42A61A4CUL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT0                (*((volatile unsigned int*)(0x42A61A50UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT1                (*((volatile unsigned int*)(0x42A61A54UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT2                (*((volatile unsigned int*)(0x42A61A58UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT3                (*((volatile unsigned int*)(0x42A61A5CUL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT4                (*((volatile unsigned int*)(0x42A61A60UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT5                (*((volatile unsigned int*)(0x42A61A64UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT6                (*((volatile unsigned int*)(0x42A61A68UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT7                (*((volatile unsigned int*)(0x42A61A6CUL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT8                (*((volatile unsigned int*)(0x42A61A70UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT9                (*((volatile unsigned int*)(0x42A61A74UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT10               (*((volatile unsigned int*)(0x42A61A78UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT11               (*((volatile unsigned int*)(0x42A61A7CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST0              (*((volatile unsigned int*)(0x42A61A00UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST1              (*((volatile unsigned int*)(0x42A61A04UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST2              (*((volatile unsigned int*)(0x42A61A08UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST3              (*((volatile unsigned int*)(0x42A61A0CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST4              (*((volatile unsigned int*)(0x42A61A10UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST5              (*((volatile unsigned int*)(0x42A61A14UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST6              (*((volatile unsigned int*)(0x42A61A18UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST7              (*((volatile unsigned int*)(0x42A61A1CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST8              (*((volatile unsigned int*)(0x42A61A20UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST9              (*((volatile unsigned int*)(0x42A61A24UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST10             (*((volatile unsigned int*)(0x42A61A28UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST11             (*((volatile unsigned int*)(0x42A61A2CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST12             (*((volatile unsigned int*)(0x42A61A30UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST13             (*((volatile unsigned int*)(0x42A61A34UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST14             (*((volatile unsigned int*)(0x42A61A38UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST15             (*((volatile unsigned int*)(0x42A61A3CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST16             (*((volatile unsigned int*)(0x42A61A40UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST17             (*((volatile unsigned int*)(0x42A61A44UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST18             (*((volatile unsigned int*)(0x42A61A48UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST19             (*((volatile unsigned int*)(0x42A61A4CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB0              (*((volatile unsigned int*)(0x42A61A50UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB1              (*((volatile unsigned int*)(0x42A61A54UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB2              (*((volatile unsigned int*)(0x42A61A58UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB3              (*((volatile unsigned int*)(0x42A61A5CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB4              (*((volatile unsigned int*)(0x42A61A60UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB5              (*((volatile unsigned int*)(0x42A61A64UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB6              (*((volatile unsigned int*)(0x42A61A68UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB7              (*((volatile unsigned int*)(0x42A61A6CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB8              (*((volatile unsigned int*)(0x42A61A70UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB9              (*((volatile unsigned int*)(0x42A61A74UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB10             (*((volatile unsigned int*)(0x42A61A78UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB11             (*((volatile unsigned int*)(0x42A61A7CUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET0               (*((volatile unsigned int*)(0x42A61A80UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET1               (*((volatile unsigned int*)(0x42A61A84UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET2               (*((volatile unsigned int*)(0x42A61A88UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET3               (*((volatile unsigned int*)(0x42A61A8CUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET4               (*((volatile unsigned int*)(0x42A61A90UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET5               (*((volatile unsigned int*)(0x42A61A94UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET6               (*((volatile unsigned int*)(0x42A61A98UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET7               (*((volatile unsigned int*)(0x42A61A9CUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET8               (*((volatile unsigned int*)(0x42A61AA0UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET9               (*((volatile unsigned int*)(0x42A61AA4UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET10              (*((volatile unsigned int*)(0x42A61AA8UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET11              (*((volatile unsigned int*)(0x42A61AACUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET12              (*((volatile unsigned int*)(0x42A61AB0UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET13              (*((volatile unsigned int*)(0x42A61AB4UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET14              (*((volatile unsigned int*)(0x42A61AB8UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET15              (*((volatile unsigned int*)(0x42A61ABCUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET16              (*((volatile unsigned int*)(0x42A61AC0UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET17              (*((volatile unsigned int*)(0x42A61AC4UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET18              (*((volatile unsigned int*)(0x42A61AC8UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET19              (*((volatile unsigned int*)(0x42A61ACCUL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT0                (*((volatile unsigned int*)(0x42A61AD0UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT1                (*((volatile unsigned int*)(0x42A61AD4UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT2                (*((volatile unsigned int*)(0x42A61AD8UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT3                (*((volatile unsigned int*)(0x42A61ADCUL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT4                (*((volatile unsigned int*)(0x42A61AE0UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT5                (*((volatile unsigned int*)(0x42A61AE4UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT6                (*((volatile unsigned int*)(0x42A61AE8UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT7                (*((volatile unsigned int*)(0x42A61AECUL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT8                (*((volatile unsigned int*)(0x42A61AF0UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT9                (*((volatile unsigned int*)(0x42A61AF4UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT10               (*((volatile unsigned int*)(0x42A61AF8UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT11               (*((volatile unsigned int*)(0x42A61AFCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST0              (*((volatile unsigned int*)(0x42A61A80UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST1              (*((volatile unsigned int*)(0x42A61A84UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST2              (*((volatile unsigned int*)(0x42A61A88UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST3              (*((volatile unsigned int*)(0x42A61A8CUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST4              (*((volatile unsigned int*)(0x42A61A90UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST5              (*((volatile unsigned int*)(0x42A61A94UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST6              (*((volatile unsigned int*)(0x42A61A98UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST7              (*((volatile unsigned int*)(0x42A61A9CUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST8              (*((volatile unsigned int*)(0x42A61AA0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST9              (*((volatile unsigned int*)(0x42A61AA4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST10             (*((volatile unsigned int*)(0x42A61AA8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST11             (*((volatile unsigned int*)(0x42A61AACUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST12             (*((volatile unsigned int*)(0x42A61AB0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST13             (*((volatile unsigned int*)(0x42A61AB4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST14             (*((volatile unsigned int*)(0x42A61AB8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST15             (*((volatile unsigned int*)(0x42A61ABCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST16             (*((volatile unsigned int*)(0x42A61AC0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST17             (*((volatile unsigned int*)(0x42A61AC4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST18             (*((volatile unsigned int*)(0x42A61AC8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST19             (*((volatile unsigned int*)(0x42A61ACCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB0              (*((volatile unsigned int*)(0x42A61AD0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB1              (*((volatile unsigned int*)(0x42A61AD4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB2              (*((volatile unsigned int*)(0x42A61AD8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB3              (*((volatile unsigned int*)(0x42A61ADCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB4              (*((volatile unsigned int*)(0x42A61AE0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB5              (*((volatile unsigned int*)(0x42A61AE4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB6              (*((volatile unsigned int*)(0x42A61AE8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB7              (*((volatile unsigned int*)(0x42A61AECUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB8              (*((volatile unsigned int*)(0x42A61AF0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB9              (*((volatile unsigned int*)(0x42A61AF4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB10             (*((volatile unsigned int*)(0x42A61AF8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB11             (*((volatile unsigned int*)(0x42A61AFCUL)))
#define bM4_DMA1_LLP2_LLP0                        (*((volatile unsigned int*)(0x42A61B08UL)))
#define bM4_DMA1_LLP2_LLP1                        (*((volatile unsigned int*)(0x42A61B0CUL)))
#define bM4_DMA1_LLP2_LLP2                        (*((volatile unsigned int*)(0x42A61B10UL)))
#define bM4_DMA1_LLP2_LLP3                        (*((volatile unsigned int*)(0x42A61B14UL)))
#define bM4_DMA1_LLP2_LLP4                        (*((volatile unsigned int*)(0x42A61B18UL)))
#define bM4_DMA1_LLP2_LLP5                        (*((volatile unsigned int*)(0x42A61B1CUL)))
#define bM4_DMA1_LLP2_LLP6                        (*((volatile unsigned int*)(0x42A61B20UL)))
#define bM4_DMA1_LLP2_LLP7                        (*((volatile unsigned int*)(0x42A61B24UL)))
#define bM4_DMA1_LLP2_LLP8                        (*((volatile unsigned int*)(0x42A61B28UL)))
#define bM4_DMA1_LLP2_LLP9                        (*((volatile unsigned int*)(0x42A61B2CUL)))
#define bM4_DMA1_LLP2_LLP10                       (*((volatile unsigned int*)(0x42A61B30UL)))
#define bM4_DMA1_LLP2_LLP11                       (*((volatile unsigned int*)(0x42A61B34UL)))
#define bM4_DMA1_LLP2_LLP12                       (*((volatile unsigned int*)(0x42A61B38UL)))
#define bM4_DMA1_LLP2_LLP13                       (*((volatile unsigned int*)(0x42A61B3CUL)))
#define bM4_DMA1_LLP2_LLP14                       (*((volatile unsigned int*)(0x42A61B40UL)))
#define bM4_DMA1_LLP2_LLP15                       (*((volatile unsigned int*)(0x42A61B44UL)))
#define bM4_DMA1_LLP2_LLP16                       (*((volatile unsigned int*)(0x42A61B48UL)))
#define bM4_DMA1_LLP2_LLP17                       (*((volatile unsigned int*)(0x42A61B4CUL)))
#define bM4_DMA1_LLP2_LLP18                       (*((volatile unsigned int*)(0x42A61B50UL)))
#define bM4_DMA1_LLP2_LLP19                       (*((volatile unsigned int*)(0x42A61B54UL)))
#define bM4_DMA1_LLP2_LLP20                       (*((volatile unsigned int*)(0x42A61B58UL)))
#define bM4_DMA1_LLP2_LLP21                       (*((volatile unsigned int*)(0x42A61B5CUL)))
#define bM4_DMA1_LLP2_LLP22                       (*((volatile unsigned int*)(0x42A61B60UL)))
#define bM4_DMA1_LLP2_LLP23                       (*((volatile unsigned int*)(0x42A61B64UL)))
#define bM4_DMA1_LLP2_LLP24                       (*((volatile unsigned int*)(0x42A61B68UL)))
#define bM4_DMA1_LLP2_LLP25                       (*((volatile unsigned int*)(0x42A61B6CUL)))
#define bM4_DMA1_LLP2_LLP26                       (*((volatile unsigned int*)(0x42A61B70UL)))
#define bM4_DMA1_LLP2_LLP27                       (*((volatile unsigned int*)(0x42A61B74UL)))
#define bM4_DMA1_LLP2_LLP28                       (*((volatile unsigned int*)(0x42A61B78UL)))
#define bM4_DMA1_LLP2_LLP29                       (*((volatile unsigned int*)(0x42A61B7CUL)))
#define bM4_DMA1_CH2CTL_SINC0                     (*((volatile unsigned int*)(0x42A61B80UL)))
#define bM4_DMA1_CH2CTL_SINC1                     (*((volatile unsigned int*)(0x42A61B84UL)))
#define bM4_DMA1_CH2CTL_DINC0                     (*((volatile unsigned int*)(0x42A61B88UL)))
#define bM4_DMA1_CH2CTL_DINC1                     (*((volatile unsigned int*)(0x42A61B8CUL)))
#define bM4_DMA1_CH2CTL_SRPTEN                    (*((volatile unsigned int*)(0x42A61B90UL)))
#define bM4_DMA1_CH2CTL_DRPTEN                    (*((volatile unsigned int*)(0x42A61B94UL)))
#define bM4_DMA1_CH2CTL_SNSEQEN                   (*((volatile unsigned int*)(0x42A61B98UL)))
#define bM4_DMA1_CH2CTL_DNSEQEN                   (*((volatile unsigned int*)(0x42A61B9CUL)))
#define bM4_DMA1_CH2CTL_HSIZE0                    (*((volatile unsigned int*)(0x42A61BA0UL)))
#define bM4_DMA1_CH2CTL_HSIZE1                    (*((volatile unsigned int*)(0x42A61BA4UL)))
#define bM4_DMA1_CH2CTL_LLPEN                     (*((volatile unsigned int*)(0x42A61BA8UL)))
#define bM4_DMA1_CH2CTL_LLPRUN                    (*((volatile unsigned int*)(0x42A61BACUL)))
#define bM4_DMA1_CH2CTL_IE                        (*((volatile unsigned int*)(0x42A61BB0UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE0               (*((volatile unsigned int*)(0x42A61D00UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE1               (*((volatile unsigned int*)(0x42A61D04UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE2               (*((volatile unsigned int*)(0x42A61D08UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE3               (*((volatile unsigned int*)(0x42A61D0CUL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE4               (*((volatile unsigned int*)(0x42A61D10UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE5               (*((volatile unsigned int*)(0x42A61D14UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE6               (*((volatile unsigned int*)(0x42A61D18UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE7               (*((volatile unsigned int*)(0x42A61D1CUL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE8               (*((volatile unsigned int*)(0x42A61D20UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE9               (*((volatile unsigned int*)(0x42A61D24UL)))
#define bM4_DMA1_MONDTCTL2_CNT0                   (*((volatile unsigned int*)(0x42A61D40UL)))
#define bM4_DMA1_MONDTCTL2_CNT1                   (*((volatile unsigned int*)(0x42A61D44UL)))
#define bM4_DMA1_MONDTCTL2_CNT2                   (*((volatile unsigned int*)(0x42A61D48UL)))
#define bM4_DMA1_MONDTCTL2_CNT3                   (*((volatile unsigned int*)(0x42A61D4CUL)))
#define bM4_DMA1_MONDTCTL2_CNT4                   (*((volatile unsigned int*)(0x42A61D50UL)))
#define bM4_DMA1_MONDTCTL2_CNT5                   (*((volatile unsigned int*)(0x42A61D54UL)))
#define bM4_DMA1_MONDTCTL2_CNT6                   (*((volatile unsigned int*)(0x42A61D58UL)))
#define bM4_DMA1_MONDTCTL2_CNT7                   (*((volatile unsigned int*)(0x42A61D5CUL)))
#define bM4_DMA1_MONDTCTL2_CNT8                   (*((volatile unsigned int*)(0x42A61D60UL)))
#define bM4_DMA1_MONDTCTL2_CNT9                   (*((volatile unsigned int*)(0x42A61D64UL)))
#define bM4_DMA1_MONDTCTL2_CNT10                  (*((volatile unsigned int*)(0x42A61D68UL)))
#define bM4_DMA1_MONDTCTL2_CNT11                  (*((volatile unsigned int*)(0x42A61D6CUL)))
#define bM4_DMA1_MONDTCTL2_CNT12                  (*((volatile unsigned int*)(0x42A61D70UL)))
#define bM4_DMA1_MONDTCTL2_CNT13                  (*((volatile unsigned int*)(0x42A61D74UL)))
#define bM4_DMA1_MONDTCTL2_CNT14                  (*((volatile unsigned int*)(0x42A61D78UL)))
#define bM4_DMA1_MONDTCTL2_CNT15                  (*((volatile unsigned int*)(0x42A61D7CUL)))
#define bM4_DMA1_MONRPT2_SRPT0                    (*((volatile unsigned int*)(0x42A61D80UL)))
#define bM4_DMA1_MONRPT2_SRPT1                    (*((volatile unsigned int*)(0x42A61D84UL)))
#define bM4_DMA1_MONRPT2_SRPT2                    (*((volatile unsigned int*)(0x42A61D88UL)))
#define bM4_DMA1_MONRPT2_SRPT3                    (*((volatile unsigned int*)(0x42A61D8CUL)))
#define bM4_DMA1_MONRPT2_SRPT4                    (*((volatile unsigned int*)(0x42A61D90UL)))
#define bM4_DMA1_MONRPT2_SRPT5                    (*((volatile unsigned int*)(0x42A61D94UL)))
#define bM4_DMA1_MONRPT2_SRPT6                    (*((volatile unsigned int*)(0x42A61D98UL)))
#define bM4_DMA1_MONRPT2_SRPT7                    (*((volatile unsigned int*)(0x42A61D9CUL)))
#define bM4_DMA1_MONRPT2_SRPT8                    (*((volatile unsigned int*)(0x42A61DA0UL)))
#define bM4_DMA1_MONRPT2_SRPT9                    (*((volatile unsigned int*)(0x42A61DA4UL)))
#define bM4_DMA1_MONRPT2_DRPT0                    (*((volatile unsigned int*)(0x42A61DC0UL)))
#define bM4_DMA1_MONRPT2_DRPT1                    (*((volatile unsigned int*)(0x42A61DC4UL)))
#define bM4_DMA1_MONRPT2_DRPT2                    (*((volatile unsigned int*)(0x42A61DC8UL)))
#define bM4_DMA1_MONRPT2_DRPT3                    (*((volatile unsigned int*)(0x42A61DCCUL)))
#define bM4_DMA1_MONRPT2_DRPT4                    (*((volatile unsigned int*)(0x42A61DD0UL)))
#define bM4_DMA1_MONRPT2_DRPT5                    (*((volatile unsigned int*)(0x42A61DD4UL)))
#define bM4_DMA1_MONRPT2_DRPT6                    (*((volatile unsigned int*)(0x42A61DD8UL)))
#define bM4_DMA1_MONRPT2_DRPT7                    (*((volatile unsigned int*)(0x42A61DDCUL)))
#define bM4_DMA1_MONRPT2_DRPT8                    (*((volatile unsigned int*)(0x42A61DE0UL)))
#define bM4_DMA1_MONRPT2_DRPT9                    (*((volatile unsigned int*)(0x42A61DE4UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET0            (*((volatile unsigned int*)(0x42A61E00UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET1            (*((volatile unsigned int*)(0x42A61E04UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET2            (*((volatile unsigned int*)(0x42A61E08UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET3            (*((volatile unsigned int*)(0x42A61E0CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET4            (*((volatile unsigned int*)(0x42A61E10UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET5            (*((volatile unsigned int*)(0x42A61E14UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET6            (*((volatile unsigned int*)(0x42A61E18UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET7            (*((volatile unsigned int*)(0x42A61E1CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET8            (*((volatile unsigned int*)(0x42A61E20UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET9            (*((volatile unsigned int*)(0x42A61E24UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET10           (*((volatile unsigned int*)(0x42A61E28UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET11           (*((volatile unsigned int*)(0x42A61E2CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET12           (*((volatile unsigned int*)(0x42A61E30UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET13           (*((volatile unsigned int*)(0x42A61E34UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET14           (*((volatile unsigned int*)(0x42A61E38UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET15           (*((volatile unsigned int*)(0x42A61E3CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET16           (*((volatile unsigned int*)(0x42A61E40UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET17           (*((volatile unsigned int*)(0x42A61E44UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET18           (*((volatile unsigned int*)(0x42A61E48UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET19           (*((volatile unsigned int*)(0x42A61E4CUL)))
