SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keta_template/common/hc32f460keta.h
#define bM4_PORT_PCRB8_LTE                        (*((volatile unsigned int*)(0x42A78C38UL)))
#define bM4_PORT_PCRB8_DDIS                       (*((volatile unsigned int*)(0x42A78C3CUL)))
#define bM4_PORT_PFSRB8_FSEL0                     (*((volatile unsigned int*)(0x42A78C40UL)))
#define bM4_PORT_PFSRB8_FSEL1                     (*((volatile unsigned int*)(0x42A78C44UL)))
#define bM4_PORT_PFSRB8_FSEL2                     (*((volatile unsigned int*)(0x42A78C48UL)))
#define bM4_PORT_PFSRB8_FSEL3                     (*((volatile unsigned int*)(0x42A78C4CUL)))
#define bM4_PORT_PFSRB8_FSEL4                     (*((volatile unsigned int*)(0x42A78C50UL)))
#define bM4_PORT_PFSRB8_FSEL5                     (*((volatile unsigned int*)(0x42A78C54UL)))
#define bM4_PORT_PFSRB8_BFE                       (*((volatile unsigned int*)(0x42A78C60UL)))
#define bM4_PORT_PCRB9_POUT                       (*((volatile unsigned int*)(0x42A78C80UL)))
#define bM4_PORT_PCRB9_POUTE                      (*((volatile unsigned int*)(0x42A78C84UL)))
#define bM4_PORT_PCRB9_NOD                        (*((volatile unsigned int*)(0x42A78C88UL)))
#define bM4_PORT_PCRB9_DRV0                       (*((volatile unsigned int*)(0x42A78C90UL)))
#define bM4_PORT_PCRB9_DRV1                       (*((volatile unsigned int*)(0x42A78C94UL)))
#define bM4_PORT_PCRB9_PUU                        (*((volatile unsigned int*)(0x42A78C98UL)))
#define bM4_PORT_PCRB9_PIN                        (*((volatile unsigned int*)(0x42A78CA0UL)))
#define bM4_PORT_PCRB9_INVE                       (*((volatile unsigned int*)(0x42A78CA4UL)))
#define bM4_PORT_PCRB9_INTE                       (*((volatile unsigned int*)(0x42A78CB0UL)))
#define bM4_PORT_PCRB9_LTE                        (*((volatile unsigned int*)(0x42A78CB8UL)))
#define bM4_PORT_PCRB9_DDIS                       (*((volatile unsigned int*)(0x42A78CBCUL)))
#define bM4_PORT_PFSRB9_FSEL0                     (*((volatile unsigned int*)(0x42A78CC0UL)))
#define bM4_PORT_PFSRB9_FSEL1                     (*((volatile unsigned int*)(0x42A78CC4UL)))
#define bM4_PORT_PFSRB9_FSEL2                     (*((volatile unsigned int*)(0x42A78CC8UL)))
#define bM4_PORT_PFSRB9_FSEL3                     (*((volatile unsigned int*)(0x42A78CCCUL)))
#define bM4_PORT_PFSRB9_FSEL4                     (*((volatile unsigned int*)(0x42A78CD0UL)))
#define bM4_PORT_PFSRB9_FSEL5                     (*((volatile unsigned int*)(0x42A78CD4UL)))
#define bM4_PORT_PFSRB9_BFE                       (*((volatile unsigned int*)(0x42A78CE0UL)))
#define bM4_PORT_PCRB10_POUT                      (*((volatile unsigned int*)(0x42A78D00UL)))
#define bM4_PORT_PCRB10_POUTE                     (*((volatile unsigned int*)(0x42A78D04UL)))
#define bM4_PORT_PCRB10_NOD                       (*((volatile unsigned int*)(0x42A78D08UL)))
#define bM4_PORT_PCRB10_DRV0                      (*((volatile unsigned int*)(0x42A78D10UL)))
#define bM4_PORT_PCRB10_DRV1                      (*((volatile unsigned int*)(0x42A78D14UL)))
#define bM4_PORT_PCRB10_PUU                       (*((volatile unsigned int*)(0x42A78D18UL)))
#define bM4_PORT_PCRB10_PIN                       (*((volatile unsigned int*)(0x42A78D20UL)))
#define bM4_PORT_PCRB10_INVE                      (*((volatile unsigned int*)(0x42A78D24UL)))
#define bM4_PORT_PCRB10_INTE                      (*((volatile unsigned int*)(0x42A78D30UL)))
#define bM4_PORT_PCRB10_LTE                       (*((volatile unsigned int*)(0x42A78D38UL)))
#define bM4_PORT_PCRB10_DDIS                      (*((volatile unsigned int*)(0x42A78D3CUL)))
#define bM4_PORT_PFSRB10_FSEL0                    (*((volatile unsigned int*)(0x42A78D40UL)))
#define bM4_PORT_PFSRB10_FSEL1                    (*((volatile unsigned int*)(0x42A78D44UL)))
#define bM4_PORT_PFSRB10_FSEL2                    (*((volatile unsigned int*)(0x42A78D48UL)))
#define bM4_PORT_PFSRB10_FSEL3                    (*((volatile unsigned int*)(0x42A78D4CUL)))
#define bM4_PORT_PFSRB10_FSEL4                    (*((volatile unsigned int*)(0x42A78D50UL)))
#define bM4_PORT_PFSRB10_FSEL5                    (*((volatile unsigned int*)(0x42A78D54UL)))
#define bM4_PORT_PFSRB10_BFE                      (*((volatile unsigned int*)(0x42A78D60UL)))
#define bM4_PORT_PCRB11_POUT                      (*((volatile unsigned int*)(0x42A78D80UL)))
#define bM4_PORT_PCRB11_POUTE                     (*((volatile unsigned int*)(0x42A78D84UL)))
#define bM4_PORT_PCRB11_NOD                       (*((volatile unsigned int*)(0x42A78D88UL)))
#define bM4_PORT_PCRB11_DRV0                      (*((volatile unsigned int*)(0x42A78D90UL)))
#define bM4_PORT_PCRB11_DRV1                      (*((volatile unsigned int*)(0x42A78D94UL)))
#define bM4_PORT_PCRB11_PUU                       (*((volatile unsigned int*)(0x42A78D98UL)))
#define bM4_PORT_PCRB11_PIN                       (*((volatile unsigned int*)(0x42A78DA0UL)))
#define bM4_PORT_PCRB11_INVE                      (*((volatile unsigned int*)(0x42A78DA4UL)))
#define bM4_PORT_PCRB11_INTE                      (*((volatile unsigned int*)(0x42A78DB0UL)))
#define bM4_PORT_PCRB11_LTE                       (*((volatile unsigned int*)(0x42A78DB8UL)))
#define bM4_PORT_PCRB11_DDIS                      (*((volatile unsigned int*)(0x42A78DBCUL)))
#define bM4_PORT_PFSRB11_FSEL0                    (*((volatile unsigned int*)(0x42A78DC0UL)))
#define bM4_PORT_PFSRB11_FSEL1                    (*((volatile unsigned int*)(0x42A78DC4UL)))
#define bM4_PORT_PFSRB11_FSEL2                    (*((volatile unsigned int*)(0x42A78DC8UL)))
#define bM4_PORT_PFSRB11_FSEL3                    (*((volatile unsigned int*)(0x42A78DCCUL)))
#define bM4_PORT_PFSRB11_FSEL4                    (*((volatile unsigned int*)(0x42A78DD0UL)))
#define bM4_PORT_PFSRB11_FSEL5                    (*((volatile unsigned int*)(0x42A78DD4UL)))
#define bM4_PORT_PFSRB11_BFE                      (*((volatile unsigned int*)(0x42A78DE0UL)))
#define bM4_PORT_PCRB12_POUT                      (*((volatile unsigned int*)(0x42A78E00UL)))
#define bM4_PORT_PCRB12_POUTE                     (*((volatile unsigned int*)(0x42A78E04UL)))
#define bM4_PORT_PCRB12_NOD                       (*((volatile unsigned int*)(0x42A78E08UL)))
#define bM4_PORT_PCRB12_DRV0                      (*((volatile unsigned int*)(0x42A78E10UL)))
#define bM4_PORT_PCRB12_DRV1                      (*((volatile unsigned int*)(0x42A78E14UL)))
#define bM4_PORT_PCRB12_PUU                       (*((volatile unsigned int*)(0x42A78E18UL)))
#define bM4_PORT_PCRB12_PIN                       (*((volatile unsigned int*)(0x42A78E20UL)))
#define bM4_PORT_PCRB12_INVE                      (*((volatile unsigned int*)(0x42A78E24UL)))
#define bM4_PORT_PCRB12_INTE                      (*((volatile unsigned int*)(0x42A78E30UL)))
#define bM4_PORT_PCRB12_LTE                       (*((volatile unsigned int*)(0x42A78E38UL)))
#define bM4_PORT_PCRB12_DDIS                      (*((volatile unsigned int*)(0x42A78E3CUL)))
#define bM4_PORT_PFSRB12_FSEL0                    (*((volatile unsigned int*)(0x42A78E40UL)))
#define bM4_PORT_PFSRB12_FSEL1                    (*((volatile unsigned int*)(0x42A78E44UL)))
#define bM4_PORT_PFSRB12_FSEL2                    (*((volatile unsigned int*)(0x42A78E48UL)))
#define bM4_PORT_PFSRB12_FSEL3                    (*((volatile unsigned int*)(0x42A78E4CUL)))
#define bM4_PORT_PFSRB12_FSEL4                    (*((volatile unsigned int*)(0x42A78E50UL)))
#define bM4_PORT_PFSRB12_FSEL5                    (*((volatile unsigned int*)(0x42A78E54UL)))
#define bM4_PORT_PFSRB12_BFE                      (*((volatile unsigned int*)(0x42A78E60UL)))
#define bM4_PORT_PCRB13_POUT                      (*((volatile unsigned int*)(0x42A78E80UL)))
#define bM4_PORT_PCRB13_POUTE                     (*((volatile unsigned int*)(0x42A78E84UL)))
#define bM4_PORT_PCRB13_NOD                       (*((volatile unsigned int*)(0x42A78E88UL)))
#define bM4_PORT_PCRB13_DRV0                      (*((volatile unsigned int*)(0x42A78E90UL)))
#define bM4_PORT_PCRB13_DRV1                      (*((volatile unsigned int*)(0x42A78E94UL)))
#define bM4_PORT_PCRB13_PUU                       (*((volatile unsigned int*)(0x42A78E98UL)))
#define bM4_PORT_PCRB13_PIN                       (*((volatile unsigned int*)(0x42A78EA0UL)))
#define bM4_PORT_PCRB13_INVE                      (*((volatile unsigned int*)(0x42A78EA4UL)))
#define bM4_PORT_PCRB13_INTE                      (*((volatile unsigned int*)(0x42A78EB0UL)))
#define bM4_PORT_PCRB13_LTE                       (*((volatile unsigned int*)(0x42A78EB8UL)))
#define bM4_PORT_PCRB13_DDIS                      (*((volatile unsigned int*)(0x42A78EBCUL)))
#define bM4_PORT_PFSRB13_FSEL0                    (*((volatile unsigned int*)(0x42A78EC0UL)))
#define bM4_PORT_PFSRB13_FSEL1                    (*((volatile unsigned int*)(0x42A78EC4UL)))
#define bM4_PORT_PFSRB13_FSEL2                    (*((volatile unsigned int*)(0x42A78EC8UL)))
#define bM4_PORT_PFSRB13_FSEL3                    (*((volatile unsigned int*)(0x42A78ECCUL)))
#define bM4_PORT_PFSRB13_FSEL4                    (*((volatile unsigned int*)(0x42A78ED0UL)))
#define bM4_PORT_PFSRB13_FSEL5                    (*((volatile unsigned int*)(0x42A78ED4UL)))
#define bM4_PORT_PFSRB13_BFE                      (*((volatile unsigned int*)(0x42A78EE0UL)))
#define bM4_PORT_PCRB14_POUT                      (*((volatile unsigned int*)(0x42A78F00UL)))
#define bM4_PORT_PCRB14_POUTE                     (*((volatile unsigned int*)(0x42A78F04UL)))
#define bM4_PORT_PCRB14_NOD                       (*((volatile unsigned int*)(0x42A78F08UL)))
#define bM4_PORT_PCRB14_DRV0                      (*((volatile unsigned int*)(0x42A78F10UL)))
#define bM4_PORT_PCRB14_DRV1                      (*((volatile unsigned int*)(0x42A78F14UL)))
#define bM4_PORT_PCRB14_PUU                       (*((volatile unsigned int*)(0x42A78F18UL)))
#define bM4_PORT_PCRB14_PIN                       (*((volatile unsigned int*)(0x42A78F20UL)))
#define bM4_PORT_PCRB14_INVE                      (*((volatile unsigned int*)(0x42A78F24UL)))
#define bM4_PORT_PCRB14_INTE                      (*((volatile unsigned int*)(0x42A78F30UL)))
#define bM4_PORT_PCRB14_LTE                       (*((volatile unsigned int*)(0x42A78F38UL)))
#define bM4_PORT_PCRB14_DDIS                      (*((volatile unsigned int*)(0x42A78F3CUL)))
#define bM4_PORT_PFSRB14_FSEL0                    (*((volatile unsigned int*)(0x42A78F40UL)))
#define bM4_PORT_PFSRB14_FSEL1                    (*((volatile unsigned int*)(0x42A78F44UL)))
#define bM4_PORT_PFSRB14_FSEL2                    (*((volatile unsigned int*)(0x42A78F48UL)))
#define bM4_PORT_PFSRB14_FSEL3                    (*((volatile unsigned int*)(0x42A78F4CUL)))
#define bM4_PORT_PFSRB14_FSEL4                    (*((volatile unsigned int*)(0x42A78F50UL)))
#define bM4_PORT_PFSRB14_FSEL5                    (*((volatile unsigned int*)(0x42A78F54UL)))
#define bM4_PORT_PFSRB14_BFE                      (*((volatile unsigned int*)(0x42A78F60UL)))
#define bM4_PORT_PCRB15_POUT                      (*((volatile unsigned int*)(0x42A78F80UL)))
#define bM4_PORT_PCRB15_POUTE                     (*((volatile unsigned int*)(0x42A78F84UL)))
#define bM4_PORT_PCRB15_NOD                       (*((volatile unsigned int*)(0x42A78F88UL)))
#define bM4_PORT_PCRB15_DRV0                      (*((volatile unsigned int*)(0x42A78F90UL)))
#define bM4_PORT_PCRB15_DRV1                      (*((volatile unsigned int*)(0x42A78F94UL)))
#define bM4_PORT_PCRB15_PUU                       (*((volatile unsigned int*)(0x42A78F98UL)))
#define bM4_PORT_PCRB15_PIN                       (*((volatile unsigned int*)(0x42A78FA0UL)))
#define bM4_PORT_PCRB15_INVE                      (*((volatile unsigned int*)(0x42A78FA4UL)))
#define bM4_PORT_PCRB15_INTE                      (*((volatile unsigned int*)(0x42A78FB0UL)))
#define bM4_PORT_PCRB15_LTE                       (*((volatile unsigned int*)(0x42A78FB8UL)))
#define bM4_PORT_PCRB15_DDIS                      (*((volatile unsigned int*)(0x42A78FBCUL)))
#define bM4_PORT_PFSRB15_FSEL0                    (*((volatile unsigned int*)(0x42A78FC0UL)))
#define bM4_PORT_PFSRB15_FSEL1                    (*((volatile unsigned int*)(0x42A78FC4UL)))
#define bM4_PORT_PFSRB15_FSEL2                    (*((volatile unsigned int*)(0x42A78FC8UL)))
#define bM4_PORT_PFSRB15_FSEL3                    (*((volatile unsigned int*)(0x42A78FCCUL)))
#define bM4_PORT_PFSRB15_FSEL4                    (*((volatile unsigned int*)(0x42A78FD0UL)))
#define bM4_PORT_PFSRB15_FSEL5                    (*((volatile unsigned int*)(0x42A78FD4UL)))
#define bM4_PORT_PFSRB15_BFE                      (*((volatile unsigned int*)(0x42A78FE0UL)))
#define bM4_PORT_PCRC0_POUT                       (*((volatile unsigned int*)(0x42A79000UL)))
#define bM4_PORT_PCRC0_POUTE                      (*((volatile unsigned int*)(0x42A79004UL)))
#define bM4_PORT_PCRC0_NOD                        (*((volatile unsigned int*)(0x42A79008UL)))
#define bM4_PORT_PCRC0_DRV0                       (*((volatile unsigned int*)(0x42A79010UL)))
#define bM4_PORT_PCRC0_DRV1                       (*((volatile unsigned int*)(0x42A79014UL)))
#define bM4_PORT_PCRC0_PUU                        (*((volatile unsigned int*)(0x42A79018UL)))
#define bM4_PORT_PCRC0_PIN                        (*((volatile unsigned int*)(0x42A79020UL)))
#define bM4_PORT_PCRC0_INVE                       (*((volatile unsigned int*)(0x42A79024UL)))
#define bM4_PORT_PCRC0_INTE                       (*((volatile unsigned int*)(0x42A79030UL)))
#define bM4_PORT_PCRC0_LTE                        (*((volatile unsigned int*)(0x42A79038UL)))
#define bM4_PORT_PCRC0_DDIS                       (*((volatile unsigned int*)(0x42A7903CUL)))
#define bM4_PORT_PFSRC0_FSEL0                     (*((volatile unsigned int*)(0x42A79040UL)))
#define bM4_PORT_PFSRC0_FSEL1                     (*((volatile unsigned int*)(0x42A79044UL)))
#define bM4_PORT_PFSRC0_FSEL2                     (*((volatile unsigned int*)(0x42A79048UL)))
#define bM4_PORT_PFSRC0_FSEL3                     (*((volatile unsigned int*)(0x42A7904CUL)))
#define bM4_PORT_PFSRC0_FSEL4                     (*((volatile unsigned int*)(0x42A79050UL)))
#define bM4_PORT_PFSRC0_FSEL5                     (*((volatile unsigned int*)(0x42A79054UL)))
#define bM4_PORT_PFSRC0_BFE                       (*((volatile unsigned int*)(0x42A79060UL)))
#define bM4_PORT_PCRC1_POUT                       (*((volatile unsigned int*)(0x42A79080UL)))
#define bM4_PORT_PCRC1_POUTE                      (*((volatile unsigned int*)(0x42A79084UL)))
#define bM4_PORT_PCRC1_NOD                        (*((volatile unsigned int*)(0x42A79088UL)))
#define bM4_PORT_PCRC1_DRV0                       (*((volatile unsigned int*)(0x42A79090UL)))
#define bM4_PORT_PCRC1_DRV1                       (*((volatile unsigned int*)(0x42A79094UL)))
#define bM4_PORT_PCRC1_PUU                        (*((volatile unsigned int*)(0x42A79098UL)))
#define bM4_PORT_PCRC1_PIN                        (*((volatile unsigned int*)(0x42A790A0UL)))
#define bM4_PORT_PCRC1_INVE                       (*((volatile unsigned int*)(0x42A790A4UL)))
#define bM4_PORT_PCRC1_INTE                       (*((volatile unsigned int*)(0x42A790B0UL)))
#define bM4_PORT_PCRC1_LTE                        (*((volatile unsigned int*)(0x42A790B8UL)))
#define bM4_PORT_PCRC1_DDIS                       (*((volatile unsigned int*)(0x42A790BCUL)))
#define bM4_PORT_PFSRC1_FSEL0                     (*((volatile unsigned int*)(0x42A790C0UL)))
#define bM4_PORT_PFSRC1_FSEL1                     (*((volatile unsigned int*)(0x42A790C4UL)))
#define bM4_PORT_PFSRC1_FSEL2                     (*((volatile unsigned int*)(0x42A790C8UL)))
#define bM4_PORT_PFSRC1_FSEL3                     (*((volatile unsigned int*)(0x42A790CCUL)))
#define bM4_PORT_PFSRC1_FSEL4                     (*((volatile unsigned int*)(0x42A790D0UL)))
#define bM4_PORT_PFSRC1_FSEL5                     (*((volatile unsigned int*)(0x42A790D4UL)))
#define bM4_PORT_PFSRC1_BFE                       (*((volatile unsigned int*)(0x42A790E0UL)))
#define bM4_PORT_PCRC2_POUT                       (*((volatile unsigned int*)(0x42A79100UL)))
#define bM4_PORT_PCRC2_POUTE                      (*((volatile unsigned int*)(0x42A79104UL)))
#define bM4_PORT_PCRC2_NOD                        (*((volatile unsigned int*)(0x42A79108UL)))
#define bM4_PORT_PCRC2_DRV0                       (*((volatile unsigned int*)(0x42A79110UL)))
#define bM4_PORT_PCRC2_DRV1                       (*((volatile unsigned int*)(0x42A79114UL)))
#define bM4_PORT_PCRC2_PUU                        (*((volatile unsigned int*)(0x42A79118UL)))
#define bM4_PORT_PCRC2_PIN                        (*((volatile unsigned int*)(0x42A79120UL)))
#define bM4_PORT_PCRC2_INVE                       (*((volatile unsigned int*)(0x42A79124UL)))
#define bM4_PORT_PCRC2_INTE                       (*((volatile unsigned int*)(0x42A79130UL)))
#define bM4_PORT_PCRC2_LTE                        (*((volatile unsigned int*)(0x42A79138UL)))
#define bM4_PORT_PCRC2_DDIS                       (*((volatile unsigned int*)(0x42A7913CUL)))
#define bM4_PORT_PFSRC2_FSEL0                     (*((volatile unsigned int*)(0x42A79140UL)))
#define bM4_PORT_PFSRC2_FSEL1                     (*((volatile unsigned int*)(0x42A79144UL)))
#define bM4_PORT_PFSRC2_FSEL2                     (*((volatile unsigned int*)(0x42A79148UL)))
#define bM4_PORT_PFSRC2_FSEL3                     (*((volatile unsigned int*)(0x42A7914CUL)))
#define bM4_PORT_PFSRC2_FSEL4                     (*((volatile unsigned int*)(0x42A79150UL)))
#define bM4_PORT_PFSRC2_FSEL5                     (*((volatile unsigned int*)(0x42A79154UL)))
#define bM4_PORT_PFSRC2_BFE                       (*((volatile unsigned int*)(0x42A79160UL)))
#define bM4_PORT_PCRC3_POUT                       (*((volatile unsigned int*)(0x42A79180UL)))
#define bM4_PORT_PCRC3_POUTE                      (*((volatile unsigned int*)(0x42A79184UL)))
#define bM4_PORT_PCRC3_NOD                        (*((volatile unsigned int*)(0x42A79188UL)))
#define bM4_PORT_PCRC3_DRV0                       (*((volatile unsigned int*)(0x42A79190UL)))
#define bM4_PORT_PCRC3_DRV1                       (*((volatile unsigned int*)(0x42A79194UL)))
#define bM4_PORT_PCRC3_PUU                        (*((volatile unsigned int*)(0x42A79198UL)))
#define bM4_PORT_PCRC3_PIN                        (*((volatile unsigned int*)(0x42A791A0UL)))
#define bM4_PORT_PCRC3_INVE                       (*((volatile unsigned int*)(0x42A791A4UL)))
#define bM4_PORT_PCRC3_INTE                       (*((volatile unsigned int*)(0x42A791B0UL)))
#define bM4_PORT_PCRC3_LTE                        (*((volatile unsigned int*)(0x42A791B8UL)))
#define bM4_PORT_PCRC3_DDIS                       (*((volatile unsigned int*)(0x42A791BCUL)))
#define bM4_PORT_PFSRC3_FSEL0                     (*((volatile unsigned int*)(0x42A791C0UL)))
#define bM4_PORT_PFSRC3_FSEL1                     (*((volatile unsigned int*)(0x42A791C4UL)))
#define bM4_PORT_PFSRC3_FSEL2                     (*((volatile unsigned int*)(0x42A791C8UL)))
#define bM4_PORT_PFSRC3_FSEL3                     (*((volatile unsigned int*)(0x42A791CCUL)))
#define bM4_PORT_PFSRC3_FSEL4                     (*((volatile unsigned int*)(0x42A791D0UL)))
#define bM4_PORT_PFSRC3_FSEL5                     (*((volatile unsigned int*)(0x42A791D4UL)))
#define bM4_PORT_PFSRC3_BFE                       (*((volatile unsigned int*)(0x42A791E0UL)))
#define bM4_PORT_PCRC4_POUT                       (*((volatile unsigned int*)(0x42A79200UL)))
#define bM4_PORT_PCRC4_POUTE                      (*((volatile unsigned int*)(0x42A79204UL)))
#define bM4_PORT_PCRC4_NOD                        (*((volatile unsigned int*)(0x42A79208UL)))
#define bM4_PORT_PCRC4_DRV0                       (*((volatile unsigned int*)(0x42A79210UL)))
#define bM4_PORT_PCRC4_DRV1                       (*((volatile unsigned int*)(0x42A79214UL)))
#define bM4_PORT_PCRC4_PUU                        (*((volatile unsigned int*)(0x42A79218UL)))
#define bM4_PORT_PCRC4_PIN                        (*((volatile unsigned int*)(0x42A79220UL)))
#define bM4_PORT_PCRC4_INVE                       (*((volatile unsigned int*)(0x42A79224UL)))
#define bM4_PORT_PCRC4_INTE                       (*((volatile unsigned int*)(0x42A79230UL)))
#define bM4_PORT_PCRC4_LTE                        (*((volatile unsigned int*)(0x42A79238UL)))
#define bM4_PORT_PCRC4_DDIS                       (*((volatile unsigned int*)(0x42A7923CUL)))
#define bM4_PORT_PFSRC4_FSEL0                     (*((volatile unsigned int*)(0x42A79240UL)))
#define bM4_PORT_PFSRC4_FSEL1                     (*((volatile unsigned int*)(0x42A79244UL)))
#define bM4_PORT_PFSRC4_FSEL2                     (*((volatile unsigned int*)(0x42A79248UL)))
#define bM4_PORT_PFSRC4_FSEL3                     (*((volatile unsigned int*)(0x42A7924CUL)))
#define bM4_PORT_PFSRC4_FSEL4                     (*((volatile unsigned int*)(0x42A79250UL)))
#define bM4_PORT_PFSRC4_FSEL5                     (*((volatile unsigned int*)(0x42A79254UL)))
#define bM4_PORT_PFSRC4_BFE                       (*((volatile unsigned int*)(0x42A79260UL)))
#define bM4_PORT_PCRC5_POUT                       (*((volatile unsigned int*)(0x42A79280UL)))
#define bM4_PORT_PCRC5_POUTE                      (*((volatile unsigned int*)(0x42A79284UL)))
#define bM4_PORT_PCRC5_NOD                        (*((volatile unsigned int*)(0x42A79288UL)))
#define bM4_PORT_PCRC5_DRV0                       (*((volatile unsigned int*)(0x42A79290UL)))
#define bM4_PORT_PCRC5_DRV1                       (*((volatile unsigned int*)(0x42A79294UL)))
#define bM4_PORT_PCRC5_PUU                        (*((volatile unsigned int*)(0x42A79298UL)))
#define bM4_PORT_PCRC5_PIN                        (*((volatile unsigned int*)(0x42A792A0UL)))
#define bM4_PORT_PCRC5_INVE                       (*((volatile unsigned int*)(0x42A792A4UL)))
#define bM4_PORT_PCRC5_INTE                       (*((volatile unsigned int*)(0x42A792B0UL)))
#define bM4_PORT_PCRC5_LTE                        (*((volatile unsigned int*)(0x42A792B8UL)))
#define bM4_PORT_PCRC5_DDIS                       (*((volatile unsigned int*)(0x42A792BCUL)))
#define bM4_PORT_PFSRC5_FSEL0                     (*((volatile unsigned int*)(0x42A792C0UL)))
#define bM4_PORT_PFSRC5_FSEL1                     (*((volatile unsigned int*)(0x42A792C4UL)))
#define bM4_PORT_PFSRC5_FSEL2                     (*((volatile unsigned int*)(0x42A792C8UL)))
#define bM4_PORT_PFSRC5_FSEL3                     (*((volatile unsigned int*)(0x42A792CCUL)))
#define bM4_PORT_PFSRC5_FSEL4                     (*((volatile unsigned int*)(0x42A792D0UL)))
#define bM4_PORT_PFSRC5_FSEL5                     (*((volatile unsigned int*)(0x42A792D4UL)))
#define bM4_PORT_PFSRC5_BFE                       (*((volatile unsigned int*)(0x42A792E0UL)))
#define bM4_PORT_PCRC6_POUT                       (*((volatile unsigned int*)(0x42A79300UL)))
#define bM4_PORT_PCRC6_POUTE                      (*((volatile unsigned int*)(0x42A79304UL)))
#define bM4_PORT_PCRC6_NOD                        (*((volatile unsigned int*)(0x42A79308UL)))
#define bM4_PORT_PCRC6_DRV0                       (*((volatile unsigned int*)(0x42A79310UL)))
#define bM4_PORT_PCRC6_DRV1                       (*((volatile unsigned int*)(0x42A79314UL)))
#define bM4_PORT_PCRC6_PUU                        (*((volatile unsigned int*)(0x42A79318UL)))
#define bM4_PORT_PCRC6_PIN                        (*((volatile unsigned int*)(0x42A79320UL)))
#define bM4_PORT_PCRC6_INVE                       (*((volatile unsigned int*)(0x42A79324UL)))
#define bM4_PORT_PCRC6_INTE                       (*((volatile unsigned int*)(0x42A79330UL)))
#define bM4_PORT_PCRC6_LTE                        (*((volatile unsigned int*)(0x42A79338UL)))
#define bM4_PORT_PCRC6_DDIS                       (*((volatile unsigned int*)(0x42A7933CUL)))
#define bM4_PORT_PFSRC6_FSEL0                     (*((volatile unsigned int*)(0x42A79340UL)))
