SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keta_template/common/hc32f460keta.h
#define bM4_PORT_PFSRC6_FSEL1                     (*((volatile unsigned int*)(0x42A79344UL)))
#define bM4_PORT_PFSRC6_FSEL2                     (*((volatile unsigned int*)(0x42A79348UL)))
#define bM4_PORT_PFSRC6_FSEL3                     (*((volatile unsigned int*)(0x42A7934CUL)))
#define bM4_PORT_PFSRC6_FSEL4                     (*((volatile unsigned int*)(0x42A79350UL)))
#define bM4_PORT_PFSRC6_FSEL5                     (*((volatile unsigned int*)(0x42A79354UL)))
#define bM4_PORT_PFSRC6_BFE                       (*((volatile unsigned int*)(0x42A79360UL)))
#define bM4_PORT_PCRC7_POUT                       (*((volatile unsigned int*)(0x42A79380UL)))
#define bM4_PORT_PCRC7_POUTE                      (*((volatile unsigned int*)(0x42A79384UL)))
#define bM4_PORT_PCRC7_NOD                        (*((volatile unsigned int*)(0x42A79388UL)))
#define bM4_PORT_PCRC7_DRV0                       (*((volatile unsigned int*)(0x42A79390UL)))
#define bM4_PORT_PCRC7_DRV1                       (*((volatile unsigned int*)(0x42A79394UL)))
#define bM4_PORT_PCRC7_PUU                        (*((volatile unsigned int*)(0x42A79398UL)))
#define bM4_PORT_PCRC7_PIN                        (*((volatile unsigned int*)(0x42A793A0UL)))
#define bM4_PORT_PCRC7_INVE                       (*((volatile unsigned int*)(0x42A793A4UL)))
#define bM4_PORT_PCRC7_INTE                       (*((volatile unsigned int*)(0x42A793B0UL)))
#define bM4_PORT_PCRC7_LTE                        (*((volatile unsigned int*)(0x42A793B8UL)))
#define bM4_PORT_PCRC7_DDIS                       (*((volatile unsigned int*)(0x42A793BCUL)))
#define bM4_PORT_PFSRC7_FSEL0                     (*((volatile unsigned int*)(0x42A793C0UL)))
#define bM4_PORT_PFSRC7_FSEL1                     (*((volatile unsigned int*)(0x42A793C4UL)))
#define bM4_PORT_PFSRC7_FSEL2                     (*((volatile unsigned int*)(0x42A793C8UL)))
#define bM4_PORT_PFSRC7_FSEL3                     (*((volatile unsigned int*)(0x42A793CCUL)))
#define bM4_PORT_PFSRC7_FSEL4                     (*((volatile unsigned int*)(0x42A793D0UL)))
#define bM4_PORT_PFSRC7_FSEL5                     (*((volatile unsigned int*)(0x42A793D4UL)))
#define bM4_PORT_PFSRC7_BFE                       (*((volatile unsigned int*)(0x42A793E0UL)))
#define bM4_PORT_PCRC8_POUT                       (*((volatile unsigned int*)(0x42A79400UL)))
#define bM4_PORT_PCRC8_POUTE                      (*((volatile unsigned int*)(0x42A79404UL)))
#define bM4_PORT_PCRC8_NOD                        (*((volatile unsigned int*)(0x42A79408UL)))
#define bM4_PORT_PCRC8_DRV0                       (*((volatile unsigned int*)(0x42A79410UL)))
#define bM4_PORT_PCRC8_DRV1                       (*((volatile unsigned int*)(0x42A79414UL)))
#define bM4_PORT_PCRC8_PUU                        (*((volatile unsigned int*)(0x42A79418UL)))
#define bM4_PORT_PCRC8_PIN                        (*((volatile unsigned int*)(0x42A79420UL)))
#define bM4_PORT_PCRC8_INVE                       (*((volatile unsigned int*)(0x42A79424UL)))
#define bM4_PORT_PCRC8_INTE                       (*((volatile unsigned int*)(0x42A79430UL)))
#define bM4_PORT_PCRC8_LTE                        (*((volatile unsigned int*)(0x42A79438UL)))
#define bM4_PORT_PCRC8_DDIS                       (*((volatile unsigned int*)(0x42A7943CUL)))
#define bM4_PORT_PFSRC8_FSEL0                     (*((volatile unsigned int*)(0x42A79440UL)))
#define bM4_PORT_PFSRC8_FSEL1                     (*((volatile unsigned int*)(0x42A79444UL)))
#define bM4_PORT_PFSRC8_FSEL2                     (*((volatile unsigned int*)(0x42A79448UL)))
#define bM4_PORT_PFSRC8_FSEL3                     (*((volatile unsigned int*)(0x42A7944CUL)))
#define bM4_PORT_PFSRC8_FSEL4                     (*((volatile unsigned int*)(0x42A79450UL)))
#define bM4_PORT_PFSRC8_FSEL5                     (*((volatile unsigned int*)(0x42A79454UL)))
#define bM4_PORT_PFSRC8_BFE                       (*((volatile unsigned int*)(0x42A79460UL)))
#define bM4_PORT_PCRC9_POUT                       (*((volatile unsigned int*)(0x42A79480UL)))
#define bM4_PORT_PCRC9_POUTE                      (*((volatile unsigned int*)(0x42A79484UL)))
#define bM4_PORT_PCRC9_NOD                        (*((volatile unsigned int*)(0x42A79488UL)))
#define bM4_PORT_PCRC9_DRV0                       (*((volatile unsigned int*)(0x42A79490UL)))
#define bM4_PORT_PCRC9_DRV1                       (*((volatile unsigned int*)(0x42A79494UL)))
#define bM4_PORT_PCRC9_PUU                        (*((volatile unsigned int*)(0x42A79498UL)))
#define bM4_PORT_PCRC9_PIN                        (*((volatile unsigned int*)(0x42A794A0UL)))
#define bM4_PORT_PCRC9_INVE                       (*((volatile unsigned int*)(0x42A794A4UL)))
#define bM4_PORT_PCRC9_INTE                       (*((volatile unsigned int*)(0x42A794B0UL)))
#define bM4_PORT_PCRC9_LTE                        (*((volatile unsigned int*)(0x42A794B8UL)))
#define bM4_PORT_PCRC9_DDIS                       (*((volatile unsigned int*)(0x42A794BCUL)))
#define bM4_PORT_PFSRC9_FSEL0                     (*((volatile unsigned int*)(0x42A794C0UL)))
#define bM4_PORT_PFSRC9_FSEL1                     (*((volatile unsigned int*)(0x42A794C4UL)))
#define bM4_PORT_PFSRC9_FSEL2                     (*((volatile unsigned int*)(0x42A794C8UL)))
#define bM4_PORT_PFSRC9_FSEL3                     (*((volatile unsigned int*)(0x42A794CCUL)))
#define bM4_PORT_PFSRC9_FSEL4                     (*((volatile unsigned int*)(0x42A794D0UL)))
#define bM4_PORT_PFSRC9_FSEL5                     (*((volatile unsigned int*)(0x42A794D4UL)))
#define bM4_PORT_PFSRC9_BFE                       (*((volatile unsigned int*)(0x42A794E0UL)))
#define bM4_PORT_PCRC10_POUT                      (*((volatile unsigned int*)(0x42A79500UL)))
#define bM4_PORT_PCRC10_POUTE                     (*((volatile unsigned int*)(0x42A79504UL)))
#define bM4_PORT_PCRC10_NOD                       (*((volatile unsigned int*)(0x42A79508UL)))
#define bM4_PORT_PCRC10_DRV0                      (*((volatile unsigned int*)(0x42A79510UL)))
#define bM4_PORT_PCRC10_DRV1                      (*((volatile unsigned int*)(0x42A79514UL)))
#define bM4_PORT_PCRC10_PUU                       (*((volatile unsigned int*)(0x42A79518UL)))
#define bM4_PORT_PCRC10_PIN                       (*((volatile unsigned int*)(0x42A79520UL)))
#define bM4_PORT_PCRC10_INVE                      (*((volatile unsigned int*)(0x42A79524UL)))
#define bM4_PORT_PCRC10_INTE                      (*((volatile unsigned int*)(0x42A79530UL)))
#define bM4_PORT_PCRC10_LTE                       (*((volatile unsigned int*)(0x42A79538UL)))
#define bM4_PORT_PCRC10_DDIS                      (*((volatile unsigned int*)(0x42A7953CUL)))
#define bM4_PORT_PFSRC10_FSEL0                    (*((volatile unsigned int*)(0x42A79540UL)))
#define bM4_PORT_PFSRC10_FSEL1                    (*((volatile unsigned int*)(0x42A79544UL)))
#define bM4_PORT_PFSRC10_FSEL2                    (*((volatile unsigned int*)(0x42A79548UL)))
#define bM4_PORT_PFSRC10_FSEL3                    (*((volatile unsigned int*)(0x42A7954CUL)))
#define bM4_PORT_PFSRC10_FSEL4                    (*((volatile unsigned int*)(0x42A79550UL)))
#define bM4_PORT_PFSRC10_FSEL5                    (*((volatile unsigned int*)(0x42A79554UL)))
#define bM4_PORT_PFSRC10_BFE                      (*((volatile unsigned int*)(0x42A79560UL)))
#define bM4_PORT_PCRC11_POUT                      (*((volatile unsigned int*)(0x42A79580UL)))
#define bM4_PORT_PCRC11_POUTE                     (*((volatile unsigned int*)(0x42A79584UL)))
#define bM4_PORT_PCRC11_NOD                       (*((volatile unsigned int*)(0x42A79588UL)))
#define bM4_PORT_PCRC11_DRV0                      (*((volatile unsigned int*)(0x42A79590UL)))
#define bM4_PORT_PCRC11_DRV1                      (*((volatile unsigned int*)(0x42A79594UL)))
#define bM4_PORT_PCRC11_PUU                       (*((volatile unsigned int*)(0x42A79598UL)))
#define bM4_PORT_PCRC11_PIN                       (*((volatile unsigned int*)(0x42A795A0UL)))
#define bM4_PORT_PCRC11_INVE                      (*((volatile unsigned int*)(0x42A795A4UL)))
#define bM4_PORT_PCRC11_INTE                      (*((volatile unsigned int*)(0x42A795B0UL)))
#define bM4_PORT_PCRC11_LTE                       (*((volatile unsigned int*)(0x42A795B8UL)))
#define bM4_PORT_PCRC11_DDIS                      (*((volatile unsigned int*)(0x42A795BCUL)))
#define bM4_PORT_PFSRC11_FSEL0                    (*((volatile unsigned int*)(0x42A795C0UL)))
#define bM4_PORT_PFSRC11_FSEL1                    (*((volatile unsigned int*)(0x42A795C4UL)))
#define bM4_PORT_PFSRC11_FSEL2                    (*((volatile unsigned int*)(0x42A795C8UL)))
#define bM4_PORT_PFSRC11_FSEL3                    (*((volatile unsigned int*)(0x42A795CCUL)))
#define bM4_PORT_PFSRC11_FSEL4                    (*((volatile unsigned int*)(0x42A795D0UL)))
#define bM4_PORT_PFSRC11_FSEL5                    (*((volatile unsigned int*)(0x42A795D4UL)))
#define bM4_PORT_PFSRC11_BFE                      (*((volatile unsigned int*)(0x42A795E0UL)))
#define bM4_PORT_PCRC12_POUT                      (*((volatile unsigned int*)(0x42A79600UL)))
#define bM4_PORT_PCRC12_POUTE                     (*((volatile unsigned int*)(0x42A79604UL)))
#define bM4_PORT_PCRC12_NOD                       (*((volatile unsigned int*)(0x42A79608UL)))
#define bM4_PORT_PCRC12_DRV0                      (*((volatile unsigned int*)(0x42A79610UL)))
#define bM4_PORT_PCRC12_DRV1                      (*((volatile unsigned int*)(0x42A79614UL)))
#define bM4_PORT_PCRC12_PUU                       (*((volatile unsigned int*)(0x42A79618UL)))
#define bM4_PORT_PCRC12_PIN                       (*((volatile unsigned int*)(0x42A79620UL)))
#define bM4_PORT_PCRC12_INVE                      (*((volatile unsigned int*)(0x42A79624UL)))
#define bM4_PORT_PCRC12_INTE                      (*((volatile unsigned int*)(0x42A79630UL)))
#define bM4_PORT_PCRC12_LTE                       (*((volatile unsigned int*)(0x42A79638UL)))
#define bM4_PORT_PCRC12_DDIS                      (*((volatile unsigned int*)(0x42A7963CUL)))
#define bM4_PORT_PFSRC12_FSEL0                    (*((volatile unsigned int*)(0x42A79640UL)))
#define bM4_PORT_PFSRC12_FSEL1                    (*((volatile unsigned int*)(0x42A79644UL)))
#define bM4_PORT_PFSRC12_FSEL2                    (*((volatile unsigned int*)(0x42A79648UL)))
#define bM4_PORT_PFSRC12_FSEL3                    (*((volatile unsigned int*)(0x42A7964CUL)))
#define bM4_PORT_PFSRC12_FSEL4                    (*((volatile unsigned int*)(0x42A79650UL)))
#define bM4_PORT_PFSRC12_FSEL5                    (*((volatile unsigned int*)(0x42A79654UL)))
#define bM4_PORT_PFSRC12_BFE                      (*((volatile unsigned int*)(0x42A79660UL)))
#define bM4_PORT_PCRC13_POUT                      (*((volatile unsigned int*)(0x42A79680UL)))
#define bM4_PORT_PCRC13_POUTE                     (*((volatile unsigned int*)(0x42A79684UL)))
#define bM4_PORT_PCRC13_NOD                       (*((volatile unsigned int*)(0x42A79688UL)))
#define bM4_PORT_PCRC13_DRV0                      (*((volatile unsigned int*)(0x42A79690UL)))
#define bM4_PORT_PCRC13_DRV1                      (*((volatile unsigned int*)(0x42A79694UL)))
#define bM4_PORT_PCRC13_PUU                       (*((volatile unsigned int*)(0x42A79698UL)))
#define bM4_PORT_PCRC13_PIN                       (*((volatile unsigned int*)(0x42A796A0UL)))
#define bM4_PORT_PCRC13_INVE                      (*((volatile unsigned int*)(0x42A796A4UL)))
#define bM4_PORT_PCRC13_INTE                      (*((volatile unsigned int*)(0x42A796B0UL)))
#define bM4_PORT_PCRC13_LTE                       (*((volatile unsigned int*)(0x42A796B8UL)))
#define bM4_PORT_PCRC13_DDIS                      (*((volatile unsigned int*)(0x42A796BCUL)))
#define bM4_PORT_PFSRC13_FSEL0                    (*((volatile unsigned int*)(0x42A796C0UL)))
#define bM4_PORT_PFSRC13_FSEL1                    (*((volatile unsigned int*)(0x42A796C4UL)))
#define bM4_PORT_PFSRC13_FSEL2                    (*((volatile unsigned int*)(0x42A796C8UL)))
#define bM4_PORT_PFSRC13_FSEL3                    (*((volatile unsigned int*)(0x42A796CCUL)))
#define bM4_PORT_PFSRC13_FSEL4                    (*((volatile unsigned int*)(0x42A796D0UL)))
#define bM4_PORT_PFSRC13_FSEL5                    (*((volatile unsigned int*)(0x42A796D4UL)))
#define bM4_PORT_PFSRC13_BFE                      (*((volatile unsigned int*)(0x42A796E0UL)))
#define bM4_PORT_PCRC14_POUT                      (*((volatile unsigned int*)(0x42A79700UL)))
#define bM4_PORT_PCRC14_POUTE                     (*((volatile unsigned int*)(0x42A79704UL)))
#define bM4_PORT_PCRC14_NOD                       (*((volatile unsigned int*)(0x42A79708UL)))
#define bM4_PORT_PCRC14_DRV0                      (*((volatile unsigned int*)(0x42A79710UL)))
#define bM4_PORT_PCRC14_DRV1                      (*((volatile unsigned int*)(0x42A79714UL)))
#define bM4_PORT_PCRC14_PUU                       (*((volatile unsigned int*)(0x42A79718UL)))
#define bM4_PORT_PCRC14_PIN                       (*((volatile unsigned int*)(0x42A79720UL)))
#define bM4_PORT_PCRC14_INVE                      (*((volatile unsigned int*)(0x42A79724UL)))
#define bM4_PORT_PCRC14_INTE                      (*((volatile unsigned int*)(0x42A79730UL)))
#define bM4_PORT_PCRC14_LTE                       (*((volatile unsigned int*)(0x42A79738UL)))
#define bM4_PORT_PCRC14_DDIS                      (*((volatile unsigned int*)(0x42A7973CUL)))
#define bM4_PORT_PFSRC14_FSEL0                    (*((volatile unsigned int*)(0x42A79740UL)))
#define bM4_PORT_PFSRC14_FSEL1                    (*((volatile unsigned int*)(0x42A79744UL)))
#define bM4_PORT_PFSRC14_FSEL2                    (*((volatile unsigned int*)(0x42A79748UL)))
#define bM4_PORT_PFSRC14_FSEL3                    (*((volatile unsigned int*)(0x42A7974CUL)))
#define bM4_PORT_PFSRC14_FSEL4                    (*((volatile unsigned int*)(0x42A79750UL)))
#define bM4_PORT_PFSRC14_FSEL5                    (*((volatile unsigned int*)(0x42A79754UL)))
#define bM4_PORT_PFSRC14_BFE                      (*((volatile unsigned int*)(0x42A79760UL)))
#define bM4_PORT_PCRC15_POUT                      (*((volatile unsigned int*)(0x42A79780UL)))
#define bM4_PORT_PCRC15_POUTE                     (*((volatile unsigned int*)(0x42A79784UL)))
#define bM4_PORT_PCRC15_NOD                       (*((volatile unsigned int*)(0x42A79788UL)))
#define bM4_PORT_PCRC15_DRV0                      (*((volatile unsigned int*)(0x42A79790UL)))
#define bM4_PORT_PCRC15_DRV1                      (*((volatile unsigned int*)(0x42A79794UL)))
#define bM4_PORT_PCRC15_PUU                       (*((volatile unsigned int*)(0x42A79798UL)))
#define bM4_PORT_PCRC15_PIN                       (*((volatile unsigned int*)(0x42A797A0UL)))
#define bM4_PORT_PCRC15_INVE                      (*((volatile unsigned int*)(0x42A797A4UL)))
#define bM4_PORT_PCRC15_INTE                      (*((volatile unsigned int*)(0x42A797B0UL)))
#define bM4_PORT_PCRC15_LTE                       (*((volatile unsigned int*)(0x42A797B8UL)))
#define bM4_PORT_PCRC15_DDIS                      (*((volatile unsigned int*)(0x42A797BCUL)))
#define bM4_PORT_PFSRC15_FSEL0                    (*((volatile unsigned int*)(0x42A797C0UL)))
#define bM4_PORT_PFSRC15_FSEL1                    (*((volatile unsigned int*)(0x42A797C4UL)))
#define bM4_PORT_PFSRC15_FSEL2                    (*((volatile unsigned int*)(0x42A797C8UL)))
#define bM4_PORT_PFSRC15_FSEL3                    (*((volatile unsigned int*)(0x42A797CCUL)))
#define bM4_PORT_PFSRC15_FSEL4                    (*((volatile unsigned int*)(0x42A797D0UL)))
#define bM4_PORT_PFSRC15_FSEL5                    (*((volatile unsigned int*)(0x42A797D4UL)))
#define bM4_PORT_PFSRC15_BFE                      (*((volatile unsigned int*)(0x42A797E0UL)))
#define bM4_PORT_PCRD2_POUT                       (*((volatile unsigned int*)(0x42A79900UL)))
#define bM4_PORT_PCRD2_POUTE                      (*((volatile unsigned int*)(0x42A79904UL)))
#define bM4_PORT_PCRD2_NOD                        (*((volatile unsigned int*)(0x42A79908UL)))
#define bM4_PORT_PCRD2_DRV0                       (*((volatile unsigned int*)(0x42A79910UL)))
#define bM4_PORT_PCRD2_DRV1                       (*((volatile unsigned int*)(0x42A79914UL)))
#define bM4_PORT_PCRD2_PUU                        (*((volatile unsigned int*)(0x42A79918UL)))
#define bM4_PORT_PCRD2_PIN                        (*((volatile unsigned int*)(0x42A79920UL)))
#define bM4_PORT_PCRD2_INVE                       (*((volatile unsigned int*)(0x42A79924UL)))
#define bM4_PORT_PCRD2_INTE                       (*((volatile unsigned int*)(0x42A79930UL)))
#define bM4_PORT_PCRD2_LTE                        (*((volatile unsigned int*)(0x42A79938UL)))
#define bM4_PORT_PCRD2_DDIS                       (*((volatile unsigned int*)(0x42A7993CUL)))
#define bM4_PORT_PFSRD2_FSEL0                     (*((volatile unsigned int*)(0x42A79940UL)))
#define bM4_PORT_PFSRD2_FSEL1                     (*((volatile unsigned int*)(0x42A79944UL)))
#define bM4_PORT_PFSRD2_FSEL2                     (*((volatile unsigned int*)(0x42A79948UL)))
#define bM4_PORT_PFSRD2_FSEL3                     (*((volatile unsigned int*)(0x42A7994CUL)))
#define bM4_PORT_PFSRD2_FSEL4                     (*((volatile unsigned int*)(0x42A79950UL)))
#define bM4_PORT_PFSRD2_FSEL5                     (*((volatile unsigned int*)(0x42A79954UL)))
#define bM4_PORT_PFSRD2_BFE                       (*((volatile unsigned int*)(0x42A79960UL)))
#define bM4_PORT_PCRH0_POUT                       (*((volatile unsigned int*)(0x42A7A800UL)))
#define bM4_PORT_PCRH0_POUTE                      (*((volatile unsigned int*)(0x42A7A804UL)))
#define bM4_PORT_PCRH0_NOD                        (*((volatile unsigned int*)(0x42A7A808UL)))
#define bM4_PORT_PCRH0_DRV0                       (*((volatile unsigned int*)(0x42A7A810UL)))
#define bM4_PORT_PCRH0_DRV1                       (*((volatile unsigned int*)(0x42A7A814UL)))
#define bM4_PORT_PCRH0_PUU                        (*((volatile unsigned int*)(0x42A7A818UL)))
#define bM4_PORT_PCRH0_PIN                        (*((volatile unsigned int*)(0x42A7A820UL)))
#define bM4_PORT_PCRH0_INVE                       (*((volatile unsigned int*)(0x42A7A824UL)))
#define bM4_PORT_PCRH0_INTE                       (*((volatile unsigned int*)(0x42A7A830UL)))
#define bM4_PORT_PCRH0_LTE                        (*((volatile unsigned int*)(0x42A7A838UL)))
#define bM4_PORT_PCRH0_DDIS                       (*((volatile unsigned int*)(0x42A7A83CUL)))
#define bM4_PORT_PFSRH0_FSEL0                     (*((volatile unsigned int*)(0x42A7A840UL)))
#define bM4_PORT_PFSRH0_FSEL1                     (*((volatile unsigned int*)(0x42A7A844UL)))
#define bM4_PORT_PFSRH0_FSEL2                     (*((volatile unsigned int*)(0x42A7A848UL)))
#define bM4_PORT_PFSRH0_FSEL3                     (*((volatile unsigned int*)(0x42A7A84CUL)))
#define bM4_PORT_PFSRH0_FSEL4                     (*((volatile unsigned int*)(0x42A7A850UL)))
#define bM4_PORT_PFSRH0_FSEL5                     (*((volatile unsigned int*)(0x42A7A854UL)))
#define bM4_PORT_PFSRH0_BFE                       (*((volatile unsigned int*)(0x42A7A860UL)))
#define bM4_PORT_PCRH1_POUT                       (*((volatile unsigned int*)(0x42A7A880UL)))
#define bM4_PORT_PCRH1_POUTE                      (*((volatile unsigned int*)(0x42A7A884UL)))
#define bM4_PORT_PCRH1_NOD                        (*((volatile unsigned int*)(0x42A7A888UL)))
#define bM4_PORT_PCRH1_DRV0                       (*((volatile unsigned int*)(0x42A7A890UL)))
#define bM4_PORT_PCRH1_DRV1                       (*((volatile unsigned int*)(0x42A7A894UL)))
#define bM4_PORT_PCRH1_PUU                        (*((volatile unsigned int*)(0x42A7A898UL)))
#define bM4_PORT_PCRH1_PIN                        (*((volatile unsigned int*)(0x42A7A8A0UL)))
#define bM4_PORT_PCRH1_INVE                       (*((volatile unsigned int*)(0x42A7A8A4UL)))
#define bM4_PORT_PCRH1_INTE                       (*((volatile unsigned int*)(0x42A7A8B0UL)))
#define bM4_PORT_PCRH1_LTE                        (*((volatile unsigned int*)(0x42A7A8B8UL)))
#define bM4_PORT_PCRH1_DDIS                       (*((volatile unsigned int*)(0x42A7A8BCUL)))
#define bM4_PORT_PFSRH1_FSEL0                     (*((volatile unsigned int*)(0x42A7A8C0UL)))
#define bM4_PORT_PFSRH1_FSEL1                     (*((volatile unsigned int*)(0x42A7A8C4UL)))
#define bM4_PORT_PFSRH1_FSEL2                     (*((volatile unsigned int*)(0x42A7A8C8UL)))
#define bM4_PORT_PFSRH1_FSEL3                     (*((volatile unsigned int*)(0x42A7A8CCUL)))
#define bM4_PORT_PFSRH1_FSEL4                     (*((volatile unsigned int*)(0x42A7A8D0UL)))
#define bM4_PORT_PFSRH1_FSEL5                     (*((volatile unsigned int*)(0x42A7A8D4UL)))
#define bM4_PORT_PFSRH1_BFE                       (*((volatile unsigned int*)(0x42A7A8E0UL)))
#define bM4_PORT_PCRH2_POUT                       (*((volatile unsigned int*)(0x42A7A900UL)))
#define bM4_PORT_PCRH2_POUTE                      (*((volatile unsigned int*)(0x42A7A904UL)))
#define bM4_PORT_PCRH2_NOD                        (*((volatile unsigned int*)(0x42A7A908UL)))
#define bM4_PORT_PCRH2_DRV0                       (*((volatile unsigned int*)(0x42A7A910UL)))
#define bM4_PORT_PCRH2_DRV1                       (*((volatile unsigned int*)(0x42A7A914UL)))
#define bM4_PORT_PCRH2_PUU                        (*((volatile unsigned int*)(0x42A7A918UL)))
#define bM4_PORT_PCRH2_PIN                        (*((volatile unsigned int*)(0x42A7A920UL)))
#define bM4_PORT_PCRH2_INVE                       (*((volatile unsigned int*)(0x42A7A924UL)))
#define bM4_PORT_PCRH2_INTE                       (*((volatile unsigned int*)(0x42A7A930UL)))
#define bM4_PORT_PCRH2_LTE                        (*((volatile unsigned int*)(0x42A7A938UL)))
#define bM4_PORT_PCRH2_DDIS                       (*((volatile unsigned int*)(0x42A7A93CUL)))
#define bM4_PORT_PFSRH2_FSEL0                     (*((volatile unsigned int*)(0x42A7A940UL)))
#define bM4_PORT_PFSRH2_FSEL1                     (*((volatile unsigned int*)(0x42A7A944UL)))
#define bM4_PORT_PFSRH2_FSEL2                     (*((volatile unsigned int*)(0x42A7A948UL)))
#define bM4_PORT_PFSRH2_FSEL3                     (*((volatile unsigned int*)(0x42A7A94CUL)))
#define bM4_PORT_PFSRH2_FSEL4                     (*((volatile unsigned int*)(0x42A7A950UL)))
#define bM4_PORT_PFSRH2_FSEL5                     (*((volatile unsigned int*)(0x42A7A954UL)))
#define bM4_PORT_PFSRH2_BFE                       (*((volatile unsigned int*)(0x42A7A960UL)))
#define bM4_RTC_CR0_RESET                         (*((volatile unsigned int*)(0x42980000UL)))
#define bM4_RTC_CR1_PRDS0                         (*((volatile unsigned int*)(0x42980080UL)))
#define bM4_RTC_CR1_PRDS1                         (*((volatile unsigned int*)(0x42980084UL)))
#define bM4_RTC_CR1_PRDS2                         (*((volatile unsigned int*)(0x42980088UL)))
#define bM4_RTC_CR1_AMPM                          (*((volatile unsigned int*)(0x4298008CUL)))
#define bM4_RTC_CR1_ALMFCLR                       (*((volatile unsigned int*)(0x42980090UL)))
#define bM4_RTC_CR1_ONEHZOE                       (*((volatile unsigned int*)(0x42980094UL)))
#define bM4_RTC_CR1_ONEHZSEL                      (*((volatile unsigned int*)(0x42980098UL)))
#define bM4_RTC_CR1_START                         (*((volatile unsigned int*)(0x4298009CUL)))
#define bM4_RTC_CR2_RWREQ                         (*((volatile unsigned int*)(0x42980100UL)))
#define bM4_RTC_CR2_RWEN                          (*((volatile unsigned int*)(0x42980104UL)))
#define bM4_RTC_CR2_ALMF                          (*((volatile unsigned int*)(0x4298010CUL)))
#define bM4_RTC_CR2_PRDIE                         (*((volatile unsigned int*)(0x42980114UL)))
#define bM4_RTC_CR2_ALMIE                         (*((volatile unsigned int*)(0x42980118UL)))
#define bM4_RTC_CR2_ALME                          (*((volatile unsigned int*)(0x4298011CUL)))
