SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keta_template/common/hc32f460keta.h
#define bM4_TMRA1_BCONR2_BEN                      (*((volatile unsigned int*)(0x422A1900UL)))
#define bM4_TMRA1_BCONR2_BSE0                     (*((volatile unsigned int*)(0x422A1904UL)))
#define bM4_TMRA1_BCONR2_BSE1                     (*((volatile unsigned int*)(0x422A1908UL)))
#define bM4_TMRA1_BCONR3_BEN                      (*((volatile unsigned int*)(0x422A1A00UL)))
#define bM4_TMRA1_BCONR3_BSE0                     (*((volatile unsigned int*)(0x422A1A04UL)))
#define bM4_TMRA1_BCONR3_BSE1                     (*((volatile unsigned int*)(0x422A1A08UL)))
#define bM4_TMRA1_BCONR4_BEN                      (*((volatile unsigned int*)(0x422A1B00UL)))
#define bM4_TMRA1_BCONR4_BSE0                     (*((volatile unsigned int*)(0x422A1B04UL)))
#define bM4_TMRA1_BCONR4_BSE1                     (*((volatile unsigned int*)(0x422A1B08UL)))
#define bM4_TMRA1_CCONR1_CAPMD                    (*((volatile unsigned int*)(0x422A2000UL)))
#define bM4_TMRA1_CCONR1_HICP0                    (*((volatile unsigned int*)(0x422A2010UL)))
#define bM4_TMRA1_CCONR1_HICP1                    (*((volatile unsigned int*)(0x422A2014UL)))
#define bM4_TMRA1_CCONR1_HICP2                    (*((volatile unsigned int*)(0x422A2018UL)))
#define bM4_TMRA1_CCONR1_HICP3                    (*((volatile unsigned int*)(0x422A2020UL)))
#define bM4_TMRA1_CCONR1_HICP4                    (*((volatile unsigned int*)(0x422A2024UL)))
#define bM4_TMRA1_CCONR1_NOFIENCP                 (*((volatile unsigned int*)(0x422A2030UL)))
#define bM4_TMRA1_CCONR1_NOFICKCP0                (*((volatile unsigned int*)(0x422A2034UL)))
#define bM4_TMRA1_CCONR1_NOFICKCP1                (*((volatile unsigned int*)(0x422A2038UL)))
#define bM4_TMRA1_CCONR2_CAPMD                    (*((volatile unsigned int*)(0x422A2080UL)))
#define bM4_TMRA1_CCONR2_HICP0                    (*((volatile unsigned int*)(0x422A2090UL)))
#define bM4_TMRA1_CCONR2_HICP1                    (*((volatile unsigned int*)(0x422A2094UL)))
#define bM4_TMRA1_CCONR2_HICP2                    (*((volatile unsigned int*)(0x422A2098UL)))
#define bM4_TMRA1_CCONR2_HICP3                    (*((volatile unsigned int*)(0x422A20A0UL)))
#define bM4_TMRA1_CCONR2_HICP4                    (*((volatile unsigned int*)(0x422A20A4UL)))
#define bM4_TMRA1_CCONR2_NOFIENCP                 (*((volatile unsigned int*)(0x422A20B0UL)))
#define bM4_TMRA1_CCONR2_NOFICKCP0                (*((volatile unsigned int*)(0x422A20B4UL)))
#define bM4_TMRA1_CCONR2_NOFICKCP1                (*((volatile unsigned int*)(0x422A20B8UL)))
#define bM4_TMRA1_CCONR3_CAPMD                    (*((volatile unsigned int*)(0x422A2100UL)))
#define bM4_TMRA1_CCONR3_HICP0                    (*((volatile unsigned int*)(0x422A2110UL)))
#define bM4_TMRA1_CCONR3_HICP1                    (*((volatile unsigned int*)(0x422A2114UL)))
#define bM4_TMRA1_CCONR3_HICP2                    (*((volatile unsigned int*)(0x422A2118UL)))
#define bM4_TMRA1_CCONR3_HICP3                    (*((volatile unsigned int*)(0x422A2120UL)))
#define bM4_TMRA1_CCONR3_HICP4                    (*((volatile unsigned int*)(0x422A2124UL)))
#define bM4_TMRA1_CCONR3_NOFIENCP                 (*((volatile unsigned int*)(0x422A2130UL)))
#define bM4_TMRA1_CCONR3_NOFICKCP0                (*((volatile unsigned int*)(0x422A2134UL)))
#define bM4_TMRA1_CCONR3_NOFICKCP1                (*((volatile unsigned int*)(0x422A2138UL)))
#define bM4_TMRA1_CCONR4_CAPMD                    (*((volatile unsigned int*)(0x422A2180UL)))
#define bM4_TMRA1_CCONR4_HICP0                    (*((volatile unsigned int*)(0x422A2190UL)))
#define bM4_TMRA1_CCONR4_HICP1                    (*((volatile unsigned int*)(0x422A2194UL)))
#define bM4_TMRA1_CCONR4_HICP2                    (*((volatile unsigned int*)(0x422A2198UL)))
#define bM4_TMRA1_CCONR4_HICP3                    (*((volatile unsigned int*)(0x422A21A0UL)))
#define bM4_TMRA1_CCONR4_HICP4                    (*((volatile unsigned int*)(0x422A21A4UL)))
#define bM4_TMRA1_CCONR4_NOFIENCP                 (*((volatile unsigned int*)(0x422A21B0UL)))
#define bM4_TMRA1_CCONR4_NOFICKCP0                (*((volatile unsigned int*)(0x422A21B4UL)))
#define bM4_TMRA1_CCONR4_NOFICKCP1                (*((volatile unsigned int*)(0x422A21B8UL)))
#define bM4_TMRA1_CCONR5_CAPMD                    (*((volatile unsigned int*)(0x422A2200UL)))
#define bM4_TMRA1_CCONR5_HICP0                    (*((volatile unsigned int*)(0x422A2210UL)))
#define bM4_TMRA1_CCONR5_HICP1                    (*((volatile unsigned int*)(0x422A2214UL)))
#define bM4_TMRA1_CCONR5_HICP2                    (*((volatile unsigned int*)(0x422A2218UL)))
#define bM4_TMRA1_CCONR5_HICP3                    (*((volatile unsigned int*)(0x422A2220UL)))
#define bM4_TMRA1_CCONR5_HICP4                    (*((volatile unsigned int*)(0x422A2224UL)))
#define bM4_TMRA1_CCONR5_NOFIENCP                 (*((volatile unsigned int*)(0x422A2230UL)))
#define bM4_TMRA1_CCONR5_NOFICKCP0                (*((volatile unsigned int*)(0x422A2234UL)))
#define bM4_TMRA1_CCONR5_NOFICKCP1                (*((volatile unsigned int*)(0x422A2238UL)))
#define bM4_TMRA1_CCONR6_CAPMD                    (*((volatile unsigned int*)(0x422A2280UL)))
#define bM4_TMRA1_CCONR6_HICP0                    (*((volatile unsigned int*)(0x422A2290UL)))
#define bM4_TMRA1_CCONR6_HICP1                    (*((volatile unsigned int*)(0x422A2294UL)))
#define bM4_TMRA1_CCONR6_HICP2                    (*((volatile unsigned int*)(0x422A2298UL)))
#define bM4_TMRA1_CCONR6_HICP3                    (*((volatile unsigned int*)(0x422A22A0UL)))
#define bM4_TMRA1_CCONR6_HICP4                    (*((volatile unsigned int*)(0x422A22A4UL)))
#define bM4_TMRA1_CCONR6_NOFIENCP                 (*((volatile unsigned int*)(0x422A22B0UL)))
#define bM4_TMRA1_CCONR6_NOFICKCP0                (*((volatile unsigned int*)(0x422A22B4UL)))
#define bM4_TMRA1_CCONR6_NOFICKCP1                (*((volatile unsigned int*)(0x422A22B8UL)))
#define bM4_TMRA1_CCONR7_CAPMD                    (*((volatile unsigned int*)(0x422A2300UL)))
#define bM4_TMRA1_CCONR7_HICP0                    (*((volatile unsigned int*)(0x422A2310UL)))
#define bM4_TMRA1_CCONR7_HICP1                    (*((volatile unsigned int*)(0x422A2314UL)))
#define bM4_TMRA1_CCONR7_HICP2                    (*((volatile unsigned int*)(0x422A2318UL)))
#define bM4_TMRA1_CCONR7_HICP3                    (*((volatile unsigned int*)(0x422A2320UL)))
#define bM4_TMRA1_CCONR7_HICP4                    (*((volatile unsigned int*)(0x422A2324UL)))
#define bM4_TMRA1_CCONR7_NOFIENCP                 (*((volatile unsigned int*)(0x422A2330UL)))
#define bM4_TMRA1_CCONR7_NOFICKCP0                (*((volatile unsigned int*)(0x422A2334UL)))
#define bM4_TMRA1_CCONR7_NOFICKCP1                (*((volatile unsigned int*)(0x422A2338UL)))
#define bM4_TMRA1_CCONR8_CAPMD                    (*((volatile unsigned int*)(0x422A2380UL)))
#define bM4_TMRA1_CCONR8_HICP0                    (*((volatile unsigned int*)(0x422A2390UL)))
#define bM4_TMRA1_CCONR8_HICP1                    (*((volatile unsigned int*)(0x422A2394UL)))
#define bM4_TMRA1_CCONR8_HICP2                    (*((volatile unsigned int*)(0x422A2398UL)))
#define bM4_TMRA1_CCONR8_HICP3                    (*((volatile unsigned int*)(0x422A23A0UL)))
#define bM4_TMRA1_CCONR8_HICP4                    (*((volatile unsigned int*)(0x422A23A4UL)))
#define bM4_TMRA1_CCONR8_NOFIENCP                 (*((volatile unsigned int*)(0x422A23B0UL)))
#define bM4_TMRA1_CCONR8_NOFICKCP0                (*((volatile unsigned int*)(0x422A23B4UL)))
#define bM4_TMRA1_CCONR8_NOFICKCP1                (*((volatile unsigned int*)(0x422A23B8UL)))
#define bM4_TMRA1_PCONR1_STAC0                    (*((volatile unsigned int*)(0x422A2800UL)))
#define bM4_TMRA1_PCONR1_STAC1                    (*((volatile unsigned int*)(0x422A2804UL)))
#define bM4_TMRA1_PCONR1_STPC0                    (*((volatile unsigned int*)(0x422A2808UL)))
#define bM4_TMRA1_PCONR1_STPC1                    (*((volatile unsigned int*)(0x422A280CUL)))
#define bM4_TMRA1_PCONR1_CMPC0                    (*((volatile unsigned int*)(0x422A2810UL)))
#define bM4_TMRA1_PCONR1_CMPC1                    (*((volatile unsigned int*)(0x422A2814UL)))
#define bM4_TMRA1_PCONR1_PERC0                    (*((volatile unsigned int*)(0x422A2818UL)))
#define bM4_TMRA1_PCONR1_PERC1                    (*((volatile unsigned int*)(0x422A281CUL)))
#define bM4_TMRA1_PCONR1_FORC0                    (*((volatile unsigned int*)(0x422A2820UL)))
#define bM4_TMRA1_PCONR1_FORC1                    (*((volatile unsigned int*)(0x422A2824UL)))
#define bM4_TMRA1_PCONR1_OUTEN                    (*((volatile unsigned int*)(0x422A2830UL)))
#define bM4_TMRA1_PCONR2_STAC0                    (*((volatile unsigned int*)(0x422A2880UL)))
#define bM4_TMRA1_PCONR2_STAC1                    (*((volatile unsigned int*)(0x422A2884UL)))
#define bM4_TMRA1_PCONR2_STPC0                    (*((volatile unsigned int*)(0x422A2888UL)))
#define bM4_TMRA1_PCONR2_STPC1                    (*((volatile unsigned int*)(0x422A288CUL)))
#define bM4_TMRA1_PCONR2_CMPC0                    (*((volatile unsigned int*)(0x422A2890UL)))
#define bM4_TMRA1_PCONR2_CMPC1                    (*((volatile unsigned int*)(0x422A2894UL)))
#define bM4_TMRA1_PCONR2_PERC0                    (*((volatile unsigned int*)(0x422A2898UL)))
#define bM4_TMRA1_PCONR2_PERC1                    (*((volatile unsigned int*)(0x422A289CUL)))
#define bM4_TMRA1_PCONR2_FORC0                    (*((volatile unsigned int*)(0x422A28A0UL)))
#define bM4_TMRA1_PCONR2_FORC1                    (*((volatile unsigned int*)(0x422A28A4UL)))
#define bM4_TMRA1_PCONR2_OUTEN                    (*((volatile unsigned int*)(0x422A28B0UL)))
#define bM4_TMRA1_PCONR3_STAC0                    (*((volatile unsigned int*)(0x422A2900UL)))
#define bM4_TMRA1_PCONR3_STAC1                    (*((volatile unsigned int*)(0x422A2904UL)))
#define bM4_TMRA1_PCONR3_STPC0                    (*((volatile unsigned int*)(0x422A2908UL)))
#define bM4_TMRA1_PCONR3_STPC1                    (*((volatile unsigned int*)(0x422A290CUL)))
#define bM4_TMRA1_PCONR3_CMPC0                    (*((volatile unsigned int*)(0x422A2910UL)))
#define bM4_TMRA1_PCONR3_CMPC1                    (*((volatile unsigned int*)(0x422A2914UL)))
#define bM4_TMRA1_PCONR3_PERC0                    (*((volatile unsigned int*)(0x422A2918UL)))
#define bM4_TMRA1_PCONR3_PERC1                    (*((volatile unsigned int*)(0x422A291CUL)))
#define bM4_TMRA1_PCONR3_FORC0                    (*((volatile unsigned int*)(0x422A2920UL)))
#define bM4_TMRA1_PCONR3_FORC1                    (*((volatile unsigned int*)(0x422A2924UL)))
#define bM4_TMRA1_PCONR3_OUTEN                    (*((volatile unsigned int*)(0x422A2930UL)))
#define bM4_TMRA1_PCONR4_STAC0                    (*((volatile unsigned int*)(0x422A2980UL)))
#define bM4_TMRA1_PCONR4_STAC1                    (*((volatile unsigned int*)(0x422A2984UL)))
#define bM4_TMRA1_PCONR4_STPC0                    (*((volatile unsigned int*)(0x422A2988UL)))
#define bM4_TMRA1_PCONR4_STPC1                    (*((volatile unsigned int*)(0x422A298CUL)))
#define bM4_TMRA1_PCONR4_CMPC0                    (*((volatile unsigned int*)(0x422A2990UL)))
#define bM4_TMRA1_PCONR4_CMPC1                    (*((volatile unsigned int*)(0x422A2994UL)))
#define bM4_TMRA1_PCONR4_PERC0                    (*((volatile unsigned int*)(0x422A2998UL)))
#define bM4_TMRA1_PCONR4_PERC1                    (*((volatile unsigned int*)(0x422A299CUL)))
#define bM4_TMRA1_PCONR4_FORC0                    (*((volatile unsigned int*)(0x422A29A0UL)))
#define bM4_TMRA1_PCONR4_FORC1                    (*((volatile unsigned int*)(0x422A29A4UL)))
#define bM4_TMRA1_PCONR4_OUTEN                    (*((volatile unsigned int*)(0x422A29B0UL)))
#define bM4_TMRA1_PCONR5_STAC0                    (*((volatile unsigned int*)(0x422A2A00UL)))
#define bM4_TMRA1_PCONR5_STAC1                    (*((volatile unsigned int*)(0x422A2A04UL)))
#define bM4_TMRA1_PCONR5_STPC0                    (*((volatile unsigned int*)(0x422A2A08UL)))
#define bM4_TMRA1_PCONR5_STPC1                    (*((volatile unsigned int*)(0x422A2A0CUL)))
#define bM4_TMRA1_PCONR5_CMPC0                    (*((volatile unsigned int*)(0x422A2A10UL)))
#define bM4_TMRA1_PCONR5_CMPC1                    (*((volatile unsigned int*)(0x422A2A14UL)))
#define bM4_TMRA1_PCONR5_PERC0                    (*((volatile unsigned int*)(0x422A2A18UL)))
#define bM4_TMRA1_PCONR5_PERC1                    (*((volatile unsigned int*)(0x422A2A1CUL)))
#define bM4_TMRA1_PCONR5_FORC0                    (*((volatile unsigned int*)(0x422A2A20UL)))
#define bM4_TMRA1_PCONR5_FORC1                    (*((volatile unsigned int*)(0x422A2A24UL)))
#define bM4_TMRA1_PCONR5_OUTEN                    (*((volatile unsigned int*)(0x422A2A30UL)))
#define bM4_TMRA1_PCONR6_STAC0                    (*((volatile unsigned int*)(0x422A2A80UL)))
#define bM4_TMRA1_PCONR6_STAC1                    (*((volatile unsigned int*)(0x422A2A84UL)))
#define bM4_TMRA1_PCONR6_STPC0                    (*((volatile unsigned int*)(0x422A2A88UL)))
#define bM4_TMRA1_PCONR6_STPC1                    (*((volatile unsigned int*)(0x422A2A8CUL)))
#define bM4_TMRA1_PCONR6_CMPC0                    (*((volatile unsigned int*)(0x422A2A90UL)))
#define bM4_TMRA1_PCONR6_CMPC1                    (*((volatile unsigned int*)(0x422A2A94UL)))
#define bM4_TMRA1_PCONR6_PERC0                    (*((volatile unsigned int*)(0x422A2A98UL)))
#define bM4_TMRA1_PCONR6_PERC1                    (*((volatile unsigned int*)(0x422A2A9CUL)))
#define bM4_TMRA1_PCONR6_FORC0                    (*((volatile unsigned int*)(0x422A2AA0UL)))
#define bM4_TMRA1_PCONR6_FORC1                    (*((volatile unsigned int*)(0x422A2AA4UL)))
#define bM4_TMRA1_PCONR6_OUTEN                    (*((volatile unsigned int*)(0x422A2AB0UL)))
#define bM4_TMRA1_PCONR7_STAC0                    (*((volatile unsigned int*)(0x422A2B00UL)))
#define bM4_TMRA1_PCONR7_STAC1                    (*((volatile unsigned int*)(0x422A2B04UL)))
#define bM4_TMRA1_PCONR7_STPC0                    (*((volatile unsigned int*)(0x422A2B08UL)))
#define bM4_TMRA1_PCONR7_STPC1                    (*((volatile unsigned int*)(0x422A2B0CUL)))
#define bM4_TMRA1_PCONR7_CMPC0                    (*((volatile unsigned int*)(0x422A2B10UL)))
#define bM4_TMRA1_PCONR7_CMPC1                    (*((volatile unsigned int*)(0x422A2B14UL)))
#define bM4_TMRA1_PCONR7_PERC0                    (*((volatile unsigned int*)(0x422A2B18UL)))
#define bM4_TMRA1_PCONR7_PERC1                    (*((volatile unsigned int*)(0x422A2B1CUL)))
#define bM4_TMRA1_PCONR7_FORC0                    (*((volatile unsigned int*)(0x422A2B20UL)))
#define bM4_TMRA1_PCONR7_FORC1                    (*((volatile unsigned int*)(0x422A2B24UL)))
#define bM4_TMRA1_PCONR7_OUTEN                    (*((volatile unsigned int*)(0x422A2B30UL)))
#define bM4_TMRA1_PCONR8_STAC0                    (*((volatile unsigned int*)(0x422A2B80UL)))
#define bM4_TMRA1_PCONR8_STAC1                    (*((volatile unsigned int*)(0x422A2B84UL)))
#define bM4_TMRA1_PCONR8_STPC0                    (*((volatile unsigned int*)(0x422A2B88UL)))
#define bM4_TMRA1_PCONR8_STPC1                    (*((volatile unsigned int*)(0x422A2B8CUL)))
#define bM4_TMRA1_PCONR8_CMPC0                    (*((volatile unsigned int*)(0x422A2B90UL)))
#define bM4_TMRA1_PCONR8_CMPC1                    (*((volatile unsigned int*)(0x422A2B94UL)))
#define bM4_TMRA1_PCONR8_PERC0                    (*((volatile unsigned int*)(0x422A2B98UL)))
#define bM4_TMRA1_PCONR8_PERC1                    (*((volatile unsigned int*)(0x422A2B9CUL)))
#define bM4_TMRA1_PCONR8_FORC0                    (*((volatile unsigned int*)(0x422A2BA0UL)))
#define bM4_TMRA1_PCONR8_FORC1                    (*((volatile unsigned int*)(0x422A2BA4UL)))
#define bM4_TMRA1_PCONR8_OUTEN                    (*((volatile unsigned int*)(0x422A2BB0UL)))
#define bM4_TMRA2_CNTER_CNT0                      (*((volatile unsigned int*)(0x422A8000UL)))
#define bM4_TMRA2_CNTER_CNT1                      (*((volatile unsigned int*)(0x422A8004UL)))
#define bM4_TMRA2_CNTER_CNT2                      (*((volatile unsigned int*)(0x422A8008UL)))
#define bM4_TMRA2_CNTER_CNT3                      (*((volatile unsigned int*)(0x422A800CUL)))
#define bM4_TMRA2_CNTER_CNT4                      (*((volatile unsigned int*)(0x422A8010UL)))
#define bM4_TMRA2_CNTER_CNT5                      (*((volatile unsigned int*)(0x422A8014UL)))
#define bM4_TMRA2_CNTER_CNT6                      (*((volatile unsigned int*)(0x422A8018UL)))
#define bM4_TMRA2_CNTER_CNT7                      (*((volatile unsigned int*)(0x422A801CUL)))
#define bM4_TMRA2_CNTER_CNT8                      (*((volatile unsigned int*)(0x422A8020UL)))
#define bM4_TMRA2_CNTER_CNT9                      (*((volatile unsigned int*)(0x422A8024UL)))
#define bM4_TMRA2_CNTER_CNT10                     (*((volatile unsigned int*)(0x422A8028UL)))
#define bM4_TMRA2_CNTER_CNT11                     (*((volatile unsigned int*)(0x422A802CUL)))
#define bM4_TMRA2_CNTER_CNT12                     (*((volatile unsigned int*)(0x422A8030UL)))
#define bM4_TMRA2_CNTER_CNT13                     (*((volatile unsigned int*)(0x422A8034UL)))
#define bM4_TMRA2_CNTER_CNT14                     (*((volatile unsigned int*)(0x422A8038UL)))
#define bM4_TMRA2_CNTER_CNT15                     (*((volatile unsigned int*)(0x422A803CUL)))
#define bM4_TMRA2_PERAR_PER0                      (*((volatile unsigned int*)(0x422A8080UL)))
#define bM4_TMRA2_PERAR_PER1                      (*((volatile unsigned int*)(0x422A8084UL)))
#define bM4_TMRA2_PERAR_PER2                      (*((volatile unsigned int*)(0x422A8088UL)))
#define bM4_TMRA2_PERAR_PER3                      (*((volatile unsigned int*)(0x422A808CUL)))
#define bM4_TMRA2_PERAR_PER4                      (*((volatile unsigned int*)(0x422A8090UL)))
#define bM4_TMRA2_PERAR_PER5                      (*((volatile unsigned int*)(0x422A8094UL)))
#define bM4_TMRA2_PERAR_PER6                      (*((volatile unsigned int*)(0x422A8098UL)))
#define bM4_TMRA2_PERAR_PER7                      (*((volatile unsigned int*)(0x422A809CUL)))
#define bM4_TMRA2_PERAR_PER8                      (*((volatile unsigned int*)(0x422A80A0UL)))
#define bM4_TMRA2_PERAR_PER9                      (*((volatile unsigned int*)(0x422A80A4UL)))
#define bM4_TMRA2_PERAR_PER10                     (*((volatile unsigned int*)(0x422A80A8UL)))
#define bM4_TMRA2_PERAR_PER11                     (*((volatile unsigned int*)(0x422A80ACUL)))
#define bM4_TMRA2_PERAR_PER12                     (*((volatile unsigned int*)(0x422A80B0UL)))
#define bM4_TMRA2_PERAR_PER13                     (*((volatile unsigned int*)(0x422A80B4UL)))
#define bM4_TMRA2_PERAR_PER14                     (*((volatile unsigned int*)(0x422A80B8UL)))
#define bM4_TMRA2_PERAR_PER15                     (*((volatile unsigned int*)(0x422A80BCUL)))
#define bM4_TMRA2_CMPAR1_CMP0                     (*((volatile unsigned int*)(0x422A8800UL)))
#define bM4_TMRA2_CMPAR1_CMP1                     (*((volatile unsigned int*)(0x422A8804UL)))
#define bM4_TMRA2_CMPAR1_CMP2                     (*((volatile unsigned int*)(0x422A8808UL)))
#define bM4_TMRA2_CMPAR1_CMP3                     (*((volatile unsigned int*)(0x422A880CUL)))
#define bM4_TMRA2_CMPAR1_CMP4                     (*((volatile unsigned int*)(0x422A8810UL)))
#define bM4_TMRA2_CMPAR1_CMP5                     (*((volatile unsigned int*)(0x422A8814UL)))
#define bM4_TMRA2_CMPAR1_CMP6                     (*((volatile unsigned int*)(0x422A8818UL)))
#define bM4_TMRA2_CMPAR1_CMP7                     (*((volatile unsigned int*)(0x422A881CUL)))
#define bM4_TMRA2_CMPAR1_CMP8                     (*((volatile unsigned int*)(0x422A8820UL)))
#define bM4_TMRA2_CMPAR1_CMP9                     (*((volatile unsigned int*)(0x422A8824UL)))
#define bM4_TMRA2_CMPAR1_CMP10                    (*((volatile unsigned int*)(0x422A8828UL)))
#define bM4_TMRA2_CMPAR1_CMP11                    (*((volatile unsigned int*)(0x422A882CUL)))
#define bM4_TMRA2_CMPAR1_CMP12                    (*((volatile unsigned int*)(0x422A8830UL)))
#define bM4_TMRA2_CMPAR1_CMP13                    (*((volatile unsigned int*)(0x422A8834UL)))
#define bM4_TMRA2_CMPAR1_CMP14                    (*((volatile unsigned int*)(0x422A8838UL)))
#define bM4_TMRA2_CMPAR1_CMP15                    (*((volatile unsigned int*)(0x422A883CUL)))
#define bM4_TMRA2_CMPAR2_CMP0                     (*((volatile unsigned int*)(0x422A8880UL)))
#define bM4_TMRA2_CMPAR2_CMP1                     (*((volatile unsigned int*)(0x422A8884UL)))
#define bM4_TMRA2_CMPAR2_CMP2                     (*((volatile unsigned int*)(0x422A8888UL)))
#define bM4_TMRA2_CMPAR2_CMP3                     (*((volatile unsigned int*)(0x422A888CUL)))
#define bM4_TMRA2_CMPAR2_CMP4                     (*((volatile unsigned int*)(0x422A8890UL)))
#define bM4_TMRA2_CMPAR2_CMP5                     (*((volatile unsigned int*)(0x422A8894UL)))
#define bM4_TMRA2_CMPAR2_CMP6                     (*((volatile unsigned int*)(0x422A8898UL)))
#define bM4_TMRA2_CMPAR2_CMP7                     (*((volatile unsigned int*)(0x422A889CUL)))
#define bM4_TMRA2_CMPAR2_CMP8                     (*((volatile unsigned int*)(0x422A88A0UL)))
#define bM4_TMRA2_CMPAR2_CMP9                     (*((volatile unsigned int*)(0x422A88A4UL)))
#define bM4_TMRA2_CMPAR2_CMP10                    (*((volatile unsigned int*)(0x422A88A8UL)))
#define bM4_TMRA2_CMPAR2_CMP11                    (*((volatile unsigned int*)(0x422A88ACUL)))
#define bM4_TMRA2_CMPAR2_CMP12                    (*((volatile unsigned int*)(0x422A88B0UL)))
#define bM4_TMRA2_CMPAR2_CMP13                    (*((volatile unsigned int*)(0x422A88B4UL)))
#define bM4_TMRA2_CMPAR2_CMP14                    (*((volatile unsigned int*)(0x422A88B8UL)))
#define bM4_TMRA2_CMPAR2_CMP15                    (*((volatile unsigned int*)(0x422A88BCUL)))
#define bM4_TMRA2_CMPAR3_CMP0                     (*((volatile unsigned int*)(0x422A8900UL)))
#define bM4_TMRA2_CMPAR3_CMP1                     (*((volatile unsigned int*)(0x422A8904UL)))
#define bM4_TMRA2_CMPAR3_CMP2                     (*((volatile unsigned int*)(0x422A8908UL)))
#define bM4_TMRA2_CMPAR3_CMP3                     (*((volatile unsigned int*)(0x422A890CUL)))
#define bM4_TMRA2_CMPAR3_CMP4                     (*((volatile unsigned int*)(0x422A8910UL)))
#define bM4_TMRA2_CMPAR3_CMP5                     (*((volatile unsigned int*)(0x422A8914UL)))
#define bM4_TMRA2_CMPAR3_CMP6                     (*((volatile unsigned int*)(0x422A8918UL)))
#define bM4_TMRA2_CMPAR3_CMP7                     (*((volatile unsigned int*)(0x422A891CUL)))
#define bM4_TMRA2_CMPAR3_CMP8                     (*((volatile unsigned int*)(0x422A8920UL)))
#define bM4_TMRA2_CMPAR3_CMP9                     (*((volatile unsigned int*)(0x422A8924UL)))
#define bM4_TMRA2_CMPAR3_CMP10                    (*((volatile unsigned int*)(0x422A8928UL)))
#define bM4_TMRA2_CMPAR3_CMP11                    (*((volatile unsigned int*)(0x422A892CUL)))
#define bM4_TMRA2_CMPAR3_CMP12                    (*((volatile unsigned int*)(0x422A8930UL)))
#define bM4_TMRA2_CMPAR3_CMP13                    (*((volatile unsigned int*)(0x422A8934UL)))
#define bM4_TMRA2_CMPAR3_CMP14                    (*((volatile unsigned int*)(0x422A8938UL)))
#define bM4_TMRA2_CMPAR3_CMP15                    (*((volatile unsigned int*)(0x422A893CUL)))
#define bM4_TMRA2_CMPAR4_CMP0                     (*((volatile unsigned int*)(0x422A8980UL)))
#define bM4_TMRA2_CMPAR4_CMP1                     (*((volatile unsigned int*)(0x422A8984UL)))
#define bM4_TMRA2_CMPAR4_CMP2                     (*((volatile unsigned int*)(0x422A8988UL)))
#define bM4_TMRA2_CMPAR4_CMP3                     (*((volatile unsigned int*)(0x422A898CUL)))
#define bM4_TMRA2_CMPAR4_CMP4                     (*((volatile unsigned int*)(0x422A8990UL)))
#define bM4_TMRA2_CMPAR4_CMP5                     (*((volatile unsigned int*)(0x422A8994UL)))
